{"intents": [
        {"tag": "greeting",
         "patterns": ["Hi", "How are you", "Is anyone there?", "Hello", "Good day"],
         "responses": ["Hello, thanks for visiting", "Good to see you", "Hi there, how can I help?"],
         "context_set": ""
        },
        {"tag": "goodbye",
         "patterns": ["Bye", "See you later", "Goodbye"],
         "responses": ["See you later, thanks for the chat", "Have a nice day", "Bye! Come back again soon."]
        },
        {"tag": "thanks",
         "patterns": ["Thanks", "Thank you", "That's helpful"],
         "responses": ["Happy to help!", "Any time!", "My pleasure"]
        },
        {"tag": "hours",
         "patterns": ["What hours are you open?", "What are your hours?", "When are you open?" ],
         "responses": ["We're open every day 9am-9pm", "Our hours are 9am-9pm every day"]
        },
        {"tag": "mopeds",
         "patterns": ["Which mopeds do you have?", "What kinds of mopeds are there?", "What do you rent?" ],
         "responses": ["We rent Yamaha, Piaggio and Vespa mopeds", "We have Piaggio, Vespa and Yamaha mopeds"]
        },
        {"tag": "payments",
         "patterns": ["Do you take credit cards?", "Do you accept Mastercard?", "Are you cash only?" ],
         "responses": ["We accept VISA, Mastercard and AMEX", "We accept most major credit cards"]
        },
        {"tag": "opentoday",
         "patterns": ["Are you open today?", "When do you open today?", "What are your hours today?"],
         "responses": ["We're open every day from 9am-9pm", "Our hours are 9am-9pm every day"]
        },
        {"tag": "rental",
         "patterns": ["Can we rent a moped?", "I'd like to rent a moped", "How does this work?" ],
         "responses": ["Are you looking to rent today or later this week?"],
         "context_set": "rentalday"
        },
        {"tag": "today",
         "patterns": ["today"],
         "responses": ["For rentals today please call 1-800-MYMOPED", "Same-day rentals please call 1-800-MYMOPED"],
         "context_filter": "rentalday"
        },
        {"tag": "Babadook", 
        "patterns": ["What did you think of the Babadook?"], 
        "responses": ["Loved it now that I finally got a chance to watch it.","Far too often nidern day horror is disappointing.","See I knew you would like it, it reminds me of a good classic horror film.","I can certainly see the comparison, it was refreshing to not rely on so many jump scares.","Yeah for me it's all about atmosphere and this film had it in spades.","Agreed it also makes me wonder what Jennifer Kent is going to direct next.","Whatever it is I eagerly anticipate it, think she's got quite the future ahead of her.","No doubt about it, Noah Wiseman also played the bratty little kid to perfection.","He did, but not sure I would necessarily say he was bratty, well okay he was, but more a product of his environment.","Yeah that kid had things pretty rough."]
        },
        {"tag": "What", "patterns":[ "What type of music do you like?"], "responses": ["I like pop, and 80s music.","Pop music is great.","Britney Spears is one of my favorite artists.","I like her too!","I wish her newer albums were better.","The older ones were the best.","Do you like the song she did with Iggy Azalea?","I wasn't a fan.","I didn't like the video either.","What other pop artists do you like?","I enjoy Christina Aguilera, Lady Gaga, Ariana Grande.","I love the song Ariana Grande did with Nicki Minaj.","\"Side to Side\".","That's a great song, the music video was awesome, too!","Nicki Minaj is so talented.","I also like her song, \"The night is still young\"\nYes, another great song and music video.","I'm really into Taylor Swift, do you like her?","I do!","Not her country songs as much as her pop songs though.","I like them all.","I love that most of her songs are written about her personal experiences.","That is awesome.","She connects better with the fans that way.","I'm glad she ventured over into pop music.","I think she's a great singer.","She really is.","I like Carrie Underwood too.","I'm not a big country music fan, but I like some of her songs."]},
{"tag": "Spotify", "patterns":[ "Hey, have you started using Spotify yet?"], "responses": ["I actually signed up a month ago!","It's changed the way I listen to music.","Me too!","I love being able to download playlists for listening on","the","go.","Have you discovered any new bands on Spotify?","I actually have been obsessed with this group called Dove & The Wolf.","I've never heard of them.","Tell me more about them!","It's two French women, and they make dreamy pop music.","It's very relaxing music.","That sounds great.","I'll have to check them out.","What about you?","What have you been listening to?","Oh, you know how much I love Andrew Bird.","I listened to him a bit in high school, but what new material does he have?","His latest album \"Are You Serious\" is a masterpiece.","He's quite the wordsmith!","And playing the violin like he does?","Have you been to any concerts recently?","Actually, yes!","I just saw Conor Oberst.","He's fantastic on recordings, but even more so live!","I love Bright Eyes!","His solo stuff is pretty good too.","Agreed!","He's just an all","around genius.","Our generation's Bob Dylan.","Check out Dove & the Wolf and you've inspired me to go listen to some Bright Eyes.","Will do!","Talk to you later!"]},
{"tag": "music", "patterns":[ "I am really drawn to alternative christian rock."], "responses": ["What do you think about it?","I'e heard a little seems cool.","could you give me a few band names?","Skillet is a great band very powerful!","Oh yeah, I will have to check them out.","what genre do you prefer.","Well, alternative rock, not necessarily Christian.","Funny, even alternative is breaking into its own genres itself.","I guess that is the way of music.Name a band that you prefer.","I really like imagine Dragons.","Oh wow, that is very close to what I like.","Perhaps  we should expand our horizons!","OK!","will try to explore more alternative music if you do too.","Ha ha, we can start with alternative.","Cage the elephant?","Cage the elephant is awesome!","Yes its still in our little box.","Acapella Alternative?","Yes we really should check that out!","OK we have an assignment!","Neat, the next time we meet we can talk about Acapello!","and Indie or whatever really I just love music!","Me too but my brain must go inch by inch, Music is so large of a subject.","I am actually in the church Choir, I have a goal to get them singing much newer songs.","I will be recommending to them.","I want to start an alternative band so this is great!","See you next time."]},
{"tag": "You", "patterns":[ "You're a musician, right?"], "responses": ["Duh.","Are the stories about instruments being destroyed true?","What do you mean?","Like, airlines breaking violins.","Holy crap, yes.","It's a nightmare.","Why is that?","Well, people who have expensive instruments on planes sometimes are forced to check them but they refuse because they'll be smashed.","Are they?","Yup, imagine a $15,000 violin for your concert that you're flying to being completely smashed because you can't protect it because they won't let you fly with it.","That sounds horrible.","Yeah, they don't respect musicians at all.","Did it happen to you?","Yup.","What happened?","I was flying home with my undergrad band.","What instrument?","Tuba.","So, how'd it break?","I saw them THROW it in the plane and others on top of it.","My valves were completely destroyed and they refused to pay for it."]},
{"tag": "What", "patterns":[ "What is your favorite band?"], "responses": ["My favorite band is Bauhaus.","I haven't heard of them.","What type of music do they play?","They're goth rock.","I think of them as straddling the punk","post punk line.","What songs have they done that I might have heard?","They covered 'Ziggy Stardust', and that gets a lot of play.","I might have heard that.","What else.","They're also known for the song 'Bela Lugosi's Dead'.","How else might I know of them?","You might know them from associated acts, and work members have done since.","What are some of those?","Well, Peter Murphy went on to have a fairly successful solo career.","Can you think of any bands that 'spun out of' or are associated with Bauhaus?","The two most popular are probably Tones on Tail and Love and Rockets.","Daniel Ash also had some solo success.","You mentioned Peter Murphy, who else was in the band?","Members included Peter Murphy, Daniel Ash, Kevin Haskins, and David J.","That's interesting thanks for sharing this information with me.","No problem.","I think their record label was Beggars Banquet.","I'll keep that in mind.","You can always sample them on iTunes or a streaming service."]},
{"tag": "Do", "patterns":[ "Do you like rap?"], "responses": ["Yes I do.","Who's your favorite rapper?","2Pac.","I like him too, why is he your favorite?","Good songs, strong message.","Makes sense, I've always been a Biggie guy myself\nEast","West, it's on now!","Uh, oh, we started another battle\nDuck and cover!","I wonder why rappers take their drama so seriously?","Sells records, that's why.","That makes sense.","No, it makes dollars.","Ha, nice one\nThought you'd like that.","We have to put some old school rap on.","Agreed, lets start East and work West\nSounds perfect!","Great!"]},
{"tag": "What", "patterns":[ "What do you think country music?"], "responses": ["I think it is great!","Johnny Cash is one of my all time favorites.","Yea, he is.","George Strait is another.","I hear his concert tickets sell out in literally two minutes.","That is quick  but I can see why.","He is really loved as a country artist.","SOme of the new ones are really good as well.","I like Jason Aldean, Lady Antebellum, Luke Bryan and others as well.","There are a lot of new ones hitting the country music scene.","You are right.","Did you watch the Country Music Awards?","Yes, I did.","Keith Urban won a lot of awards.","I can see why, he is excellent.","He has had a lot of number one hits.","He sure has.","I would love to see some of these people in concert.","Especially George Strait, I love his PURE COUNTRY CD.","I would too, that would be fun.","I would love to see Carrie Underwood.","She has a lot of good songs, I love the song Jesus Take the Wheel.","That is a good one.","I am going to ask for tickets for Christmas to see a concert.","That sounds like a great idea!"]},
{"tag": "Ewww", "patterns":[ "I recently began listening to Country music again\nEwww, I hate country\nWhen is the last time you listened to it?"], "responses": ["I never have, Dolly Parton <shiver>\nYou should try giving it a shot, it's not the same\nWhat do you mean?","These days it is a blend of country, christian and rock\nWhat do you mean?","Just like I said, besides the guys are so freaking hot!","Oh really, name one\nOne, I can name plenty, Luke Bryan, Keith Urban\nI've heard of them\nWhy do you think that is so?","They are mainstream baby!","Well, I guess.","Why don't you just give it a shot.","I guarantee you will be pleasantly surprised\nIf you say so\nI say so.","Come on, give it a shot.","Ok, I will\nGreat!","Let me know how it goes and what you think\nI will"]},
{"tag": "Who", "patterns":[ "Who would you say is your favorite male musician, and who is your favorite female musician?"], "responses": ["Female musician is easy.","Beyonce Knowles.","Yeah, she's pretty cool.","I'm a huge fan of hers.","I think her new album Lemonade was outstanding.","It had some hot tracks.","OK, what about favorite male musician?","Can it be someone who is no longer alive?","Sure.","Then David Bowie.","The man was a genius, and I'm sad he's no longer with us.","I loved Ziggy Stardust.","He was such a fascinating character.","And his music was sublime.","Can you imagine a collaboration between Beyonce and Bowie?","That would be beyond awesome!","Too bad it will never happen.","Yeah, it's a shame.","So who are your favorite male and female musicians?","I'd probably say Prince for male, Jean Grae for female.","I obviously know who Prince is, but who is Jean Grae?","She is a rapper.","Born in South Africa, grew up in NYC.","Huh.","Never heard of her.","Yeah, she's not super mainstream.","But her music is top notch!","I'll check her out, thanks for the recommendation."]},
{"tag": "Do", "patterns":[ "Do you like to listen to music?"], "responses": ["I sure do!","What kind of music do you like to listen to?","Well, it depends.","Depends on what?","When I want music in the background when I' focusing on something else, I like to listen to classical music or piano versions of popular songs.","Interesting!","Do you think that helps you focus more?","It really does!","What kind of classical music do you like?","Mozart if probably my favorite.","What other kinds of music do you listen to?","I find J","Pop really energizing when I don't have to concentrate quite as heavily.","That sound fun!","It really is.","Any other types of music you enjoy?","Well, when I'm not worried about concentrating at all, there are a ton of different songs I enjoy.","I really enjoy Broadway.","What are some of your favorite musicals?","Next to Normal, Hamilton, Wicked...","I could go on for a while.","Sounds like you really enjoy music!","I really do."]},
{"tag": "What", "patterns":[ "What music decade is your favorite?"], "responses": ["I would have to say the 80s.","So many classics came from that era.","I liked Madonna back then and now.","I remember when Material Girl came out in 1984.","Like a Virgin was one of my favorite albums.","Her songs are so catchy.","She had a great voice and talent.","She sold more records than any female artist.","They didn't call her the Queen of Pop for nothing.","Her tours attracted millions of people.","People really wanted to see her live.","She had some great performances.","I liked her when she performed at the Super Bowl.","Yeah, she was wearing the leather jacket that was pretty recent.","It was in the 2000s.","She's still got all the talent after all these years.","She was an icon that people looked up to.","She influenced many artists.","I'm sure Taylor Swift was influenced by her."]},
{"tag": "Ellie", "patterns":[ "Have you ever listened to some of Ellie Goulding's work?"], "responses": ["She has some amazing songs, quite beautiful.","Oh yes, she really is.","I love her style and one of her recent ones is my favorites right now.","Which one is that?","I saw On My Mind Video, it's really a great song.","I heard the song , but I have not seen the video yet.","That video has over 230 milion views already.","It is amazing how the videos can go viral like that.","I started listening to her songs when a movie came out with one of my favorites of hers.","Which song is your favorite of Ellie's?","Love Me Like You Do is a huge hit, I am not sure how many that song received for views but its big I am sure.","Yeah, that song was in Fifty Shades, it was nice.","I think she received some awards for that song.","Some of her other work is great too, like Burn.","How Long Will I love You and First Time are fantastic, I probably need to get a DVD of her songs.","They have some sales going on over at Target and Walmart for DVDs right now.","Maybe I will go over there this weekend, and check out the sales!","Oh, I know.","I love the music sales!","I go often just to see if I can get a few DVDs for my collection.","Let me know if you find anything."]},
{"tag": "What", "patterns":[ "What is your favorite type of music?"], "responses": ["I like all types.","Do you have one you like more than another?","If I had to say it would be rock.","Do you like hard rock.","I like more 80s hair metal rock.","So stuff like Motley Crue.","Yes, but I'm not a big Crue fan.","Who's your favorite band?","I would say Guns and Roses.","I love the song November Rain.","My favorite is Welcome to the Jungle.","That is a great song.","They play that before WWE wrestling events.","They play that before alot of events.","My other favorite song is Kick start my heart.","That is another great song.","It gets me pumped.","I drive way to fast when that song is on the radio.","It kick starts my heart too."]},
{"tag": "Chris", "patterns":[ "Did you hear Chris Cornnell died?"], "responses": ["No.","What happened?!","He hung himself after a concert.","No way.","That's so sad.","Yeah, I'm pretty bummed.","I didn't know he was even still touring.","Yeah, he was touring with Sound Garden.","I love that band.","Me too.","Looks like another grunge front man down.","Yeah, that's so weird.","Like Cobain.","Man, this is depressing.","I just don't understand.","Must be a lot of pressure being a rock 'n roller.","I guess.","Anonymity has it's advantages.","Well, I guess I'm giving up on the dream of being a star.","Oh, yeah.","You play an instrument.","I play a wicked kazoo.","Don't thing you would have realized your dream anyway!"]},
{"tag": "Who", "patterns":[ "Who are you listening to right now?"], "responses": ["Oh, I've got an old Luke Bryan CD playing.","I liked some of his stuff, but his newer stuff seems a lot less country.","I think you could say that about all country music in general.","I guess so, it seems like pop and country are getting closer and closer every year.","You don't like the crossover?","Too much of a purist?","I think there is value in both, but what is Kid Rock doing making country music, or Nelly?","I think its great that its becoming more popular, everybody loves trucks and cowboy boots.","There used to be more to country than trucks and girls and boots.","I think at its core, country was always about those things.","I don't know that I agree.","There is that old saying about what you get if you play a country song backwards.","Your dog, truck, and house back?","That's exactly what I'm saying.","I think there used to be more emotion in country.","It was more about the feelings and lifestyle than just the boots.","Maybe, but there's barely any country in some country music.","I don't know if it gets any moer country than \"Drinkin beer and Wastin Bullets\".","I don't know that song.","It's an older Luke Bryan.","It's about deer hunting.","Well that is pretty country, but its still recreational.","It's not living off the land.","Um, deer are off the land.","And if you get one, you get to eat it.","I just think country used to be about homesteads and heartbreak, not one night stands and hangovers."]},
{"tag": "Okay", "patterns":[ "Lets talk about music\nOkay that sounds good\nI love miranda lambert\nShes pretty good\nShes so empowering\nI love her songs\nThey are great\nWhats your favorite song?"], "responses": ["Definitely Kerosene\nThats a good one\nWhat about you\nI really like gunpowder and lead\nThats a good one too\nInlike how shes a harder side of county\nExactly dont cheat on moranda lambert\nNope you would definitely regret it\nI want to get one of her albums\nMe too\nIll have to go to walmart\nSame"]},
{"tag": "Baby", "patterns":[ "Hi there, Baby."], "responses": ["You listening to music?","blah blah gooby do\nI'm sorry.","I didn't quite catch that.","I think Raffi is rotting your brain.","You should try something else.","garble goof ferby snot plah\nThat's right, he is Canadian, but I won't hold that against him.","furfle furfle dinky blog nerby ckin\nHe was born in Egypt?","I had no idea.","You're brighter than I thought.","What's your favorite Raffi song?","pffffffffffffffft\nI'm sorry, one more time.","pffffffffftttBeluga\nBeluga?","The whale?","Can you sing some for me?","ggggggnoooo\nAlrighty.","What else can you tell me about Raffi?","snutvertflibbypocpocsnie\nHe's never advertised to kids?","That's actually very interesting.","It certainly hasn't hurt his sales.","I appreciate that.","I was forced to watch a ton of ads when I was a kid, mostly about the joys of smoking.","Did you know my parents used to buy me candy cigarettes?","gobblyzzzertysnat!!!","Sorry, sorry.","Got off the point there.","Ok, big question; Raffi or The Wiggles?","Badbadbadbasdbadsbadbadbadffffffffffttg!!!","Raffi it is then.","Maybe I'll listen sometime.","Well, kid, see you around.","I'm late for that thing that I gots.","poopoo"]},
{"tag": "Something", "patterns":[ "How do you feel about Something Corporate?"], "responses": ["Are you talking about the band?","I am!","Do you know their music?","I have heard a few songs.","But I do not know their music well.","They're one of my favorite bands.","Do they still write music together?","Not really.","The members have moved on to other bands.","Who was the lead singer of the band?","His name is Andrew McMahon.","And he has joined another band too?","He did indeed!","His band is doing very well.","What are they called?","The name of his new band is Andrew McMahon In The Wilderness.","That is an odd name.","I agree.","It is.","But the music is fantastic.","What style of music does the band play?","They play indie and alternative music.","That is one of my favorite genres.","You should check out the band in that case.","They have been getting a lot of radio play lately.","I will listen for them next time I am in the car!"]},
{"tag": "Beatles", "patterns":[ "Do you like the Beatles?"], "responses": ["Yeah, I love them!","Cool.","Which album is your favorite?","I really like Sgt.","Pepper.","Oh, that's interesting!","So you like their more experimental work?","Yes, I think they really started to experiment with Revolver, and it just kept getting better from there.","My favorite album is the White Album.","That's a really beautiful album.","So you tend to like their later stuff?","I like all of it, even their earlier sappy stuff that got them famous.","That's funny, I don't really like anything before Rubber Soul.","I guess I don't like the poppy love songs.","Yeah I get that.","They're just so melodic, it's hard not to sing along to them.","So have you listened to all the Anthologies?","Yes, I really like the 2nd Anthology.","How about you?","I have, but not closely.","What did you lie about the 2nd one?","Just hearing them experiment and say funny things.","Yeah and they have some good alternative versions, if I recall.","Yes.","And some funny ones.","Could I borrow some of them from you?","I'd like to listen to them.","Yeah, of course!","I'll send you all three of them.","Cool, thanks!","Looking forward to discussing the 2nd one with you after I listen to it."]},
{"tag": "Rolling", "patterns":[ "What do you think are the best all","time Rolling Stones songs?"], "responses": ["How about Beast of Burden?","I think that's the name, isn't it?","That's a good one.","I like Start Me Up.","Yeah, I can definitely imagine Mick strutting around for that one.","I can't believe he's still going.","He just had a baby.","I wonder if he ever imagined how successful the Stones would be.","You've got to give him credit.","But don't forget Keith Richards.","Or the drummer?","I think it was Charlie Watts.","I think so.","He always had a cool vibe.","I think Charlie Watts was supposed to be the sane member, the straight man, as they say.","Usually the drummer is the crazy one.","That's true.","I think they just get in a rhythmic zone and don't have to think too much.","I should have been a rock drummer.","But I'd probably lose my hearing.","I don't even think you need to hear.","You can just feel the beat through your body.","Who are the other great rock drummers?","Maybe Neil Peart, from Rush.","I think he wrote most of their lyrics too.","I always liked their lyrics.","I don't get why so many people hate Rush.","I don't know.","They kind of did their own thing for a long time.","They make make you think, even when you're having a good time."]},
{"tag": "Who", "patterns":[ "Who is your favorite female singer?"], "responses": ["I think that would be Amy Lee.","You heard of her, right?","Yes of course.","The lead singer of Evanescence.","I absolutely adore her voice.","It's so beautiful and haunting.","I haven't heard anything about her in a while though.","Did she take a break from making music?","She did have a break, as she became a mother and had to focus on that for a bit.","But she's actually just released a new song recently.","What's the song called?","It's called Love Exists.","It's a bit different than her other material, but still very beautiful.","I'll have to search for it and give it a listen.","It's actually an English cover of Francesca Michielin's song called \"L'amore esiste\".","Who is Francesca Michielin?","She's an Italian singer","songwriter.","She won the fifth series of the Italian talent show X Factor.","Interesting.","Amy Lee usually writes her own songs.","That's true, but she heard the song while working on a project in Italy and loved it.","Yeah sounds like the song was quite special if she wanted to make it her own.","Evanescence is actually working on a new album as well.","Sounds great.","When is it expected to be released?","This fall.","It's called Synthesis and it will feature some of the new tracks combined with some of the older ones.","Ah, so basically a synergy of the present and the past.","Yeah, that's basically the idea behind it.","Should be interesting to hear it once it's released."]},
{"tag": "Lorde", "patterns":[ "Did you see that the new Lorde album, Melodrama, is out?"], "responses": ["No way?","Already?","I love the song \"Green Light.\"","I do too!","But that's not the best song on the album.","What do you think is the best song on the album, then?","I really like the track, \"Hard Feelings/Loveless.\"","It's over 6 minutes long!","I'll have to listen to it.","How do you think \"Melodrama\" compares to her last album?","Well, Lorde is defintiely growing up.","\"Pure Heroine\" was written in the middle of being a teenager.","This album feels more adult.","She was still a teenager when she wrote it though, right?","Yeah, she was 18 and 19 I think.","She's 20 now.","But she was 16 when \"Pure Heroine\" came out.","How does it feel more mature?","There's a lot more heartbreak on this album.There's still a sense of youthful recklessness, but she's more jaded.","She's always been a little jaded.","Never your candy teenage pop.","Anything but!","She did get some critcism on \"Green Light\" for being too similar to Taylor Swift, though.","They're good friends, aren't they?","They are.","But did you see the comment Lorde just made about their relationship?","A lot of people are quite angry.","No, I didn't.","What did Lorde say?","She compared her friendship with T","Swift as like having a friend with an autoimmune disorder.","As in, there's many things she can't do.","That's rather insensitive.","Why did she say that?","I don't know!","Lorde should know better.","But here comes the public apology!","Why don't celebrities just think the first time around?"]},
{"tag": "music", "patterns":[ "I went to the mall and checked out some sales at the music store."], "responses": ["Really?","Did you find anything?","Yes I found some cds on Whitney Houston's music.","It was sad of her passing and her daughter.","Yes, it was.","I found a cd of hers, did you ever get Whitney Houston live?","No, but I have heard many of her songs.","Did you find that one there?","Yes, it was on sale.","I also bought I will Always Love You.","That album was very popular, I do believe people called her the Voice.","Yes, she was definitely gifted, not many today have a voice like she had.","What are some of your favorite songs of hers?","I Wanna Dance With Somebody, I Will Always Love You, All The Man That I Need are my favorites.","Did you see any other artists work while you were down there?","I saw Bruno Mars, Miley Cyrus, Lady Gaga to name a few that had sales going on their music.","How much is the discount?","The sale is buy one get one half off.","I will need to go down there and see what treasures I can find too!","I did not bring enough cash for anymore, so I only bought Whitney's, a great deal.","One of my favorite memories of her was at a national Superbowl game.","She sang the national anthem, and lit the place up!","Oh,  I remember, she was amazing!"]},
{"tag": "Cold", "patterns":[ "Didi you hear the new song by Cold Play?"], "responses": ["No I haven't.","You should listen to it.","I definitely will.","I love that band.","Yes, they are very good.","You should also check the video of the song.","Oh, great.","I like music in music videos better.","The melody is very catchy.","So, what is the name of the song?","A Sky Full Of Stars.","That song is not new...","It's from at least 2 or 3 years ago.","Really?","I just heard it recently.","Yes.","It is very good but now it's kind of old.","It is amazing how music goes out of date so quickly now a days.","Yes.","But I mean, that song is still great.","Yes, I heard it and I loved it.","I should be the one recommending new songs to you.","Yeah.","Please do.","Listen to Hypnotised.","That's their latest single.","I will.","Thanks for the update.","Sure.","Bye."]},
{"tag": "Who", "patterns":[ "Who is the greatest rapper of all time?"], "responses": ["That's easy, Eminem.","Can you say that with absolute certainty?","Yes, can't you?","No, there are a lot more options to consider.","Like who?","Tupac, Biggie etc...\nYea but, while they are legends, they cant hold a candle to Em lyrically.","Tupac was a poet, you cant deny that.","Yes he was and he is probably the second best of all time.","Oh come on!","Second best?!?!","Second best.","Pac was involved int he community and meant something to Rap beyond a lyrical level, that has to count for something.","Eminem was beat as a kid and treated unfairly, does that count?","In a sense, but not as much as Pacs contributions to the community.","How so?","Well, would the culture of the black community have changed if Pac wasnt around?","I'm sure eventually.","Right, but did Eminem change the culture?","Touche my friend, touche."]},
{"tag": "music", "patterns":[ "I'm listening to my favorite song right now."], "responses": ["Oh really, What is it?","No Rain by Blind Melon.","Oh I have never heard of them.","Its a grunge rock bank from the 90's\nI like grunge rock like Nirvana.","Yes they are similar.","Just more clear vocals.","I should check it out!","I need some 90's tunes on my playlist.","I'll let you borrow my CD.","CD I dont even have a CD player.","Ill get it off yout playlist.","Yeah you should check out all my music.","I've really been into ALT","J and Neutral Milk Hotel lately.","Oh really what songs should i look up?","Look up breeze blocks and oh comely.","What kind of music is it?","ALT","J is super intense!","I like them while working out or when i need to be in my own world.","Whats Neutral Milk Hotel about?","The album airplane under the sea tells a story.","Its more calm music.","Any other suggestions to download?","I'm looking for some calm music.","Look up Bon Iver.","So relaxing and his voice will put you in a trance.","My favorite is Flume!","Thanks for all the Suggestions!","I feel like you gave me a lot of good artist with different feels to them!"]},
{"tag": "Woodstock", "patterns":[ "Do you remember Woodstock?"], "responses": ["I sure do.","I wanted to go.","I did too but I was sixteen and my mother would not let me.","There sure were some amazing bands there.","Yes, Janis Joplin, Jimi Hendrix, and more.","Jefferson Airplane was there and so was Country Joe and the Fish.","I remember the Fish Cheer.","Me too, that was classic.","I had the album.","So did I and would listen to it over and over again.","Crosby Stills Nash and Young did Wooden Ships, great song!","Yea, that was a good song.","A lot of up and coming musicians came out of Woodstock.","They sure did.","Remember Joe Cocker?","Yes I do\nHe passed away not too long ago.","He sang A Little Help from my Friends.","That was a good song.","Boy I wish I could go back in time.","Me too, I would love to go to that concert.","Yea, those were the days of some great music."]},
{"tag": "Do", "patterns":[ "Do you like luke combs?"], "responses": ["Yes i love listening to him\nI just bought his album\nWhen did that come out?","June 2nd\nI need to get it\nI got mine at walmart\nIll have to go down there later\nHopefully they have some\nIm sure they will\nIf you like him, you will love the album\nWhats it called\nThis ones for you\nDoes it have dont tempt me on it?","Yes and I got away with you\nI love that song\nIt really is a great album\nI cant wsit to pick it up\nHope you like it\nI will"]},
{"tag": "What", "patterns":[ "What do you think about correcting pop and rap lyrics?"], "responses": ["What do you mean?","There's a YouTube channel called \"Grammatically correct rap\" or something.","Sounds like something I'd love!","Yeah, I'm sure.","I correct lyrics all the time.","I know, it's kind of irritating.","So what's your beef with it?","Do you think it's insulting?","I think it's insulting to disrespect basic grammar.","Can I offer an explanation as to why?","Sure.","English teachers don't write music.","It's not entertainment, really.","So?","So, music in all forms doesn't keep proper grammar because it doesn't work.","Why not?","Think about rhymes.","okay?","It's way harder to rhyme grammatically correct words than those considered incorrect.","It's easier on the ears.","Yeah, but if it's more difficult, it should be more respected, like art music.","They always use proper grammar and it's just as fun."]},
{"tag": "Amy", "patterns":[ "Do you know much of Amy Winehouse's music?"], "responses": ["I think I know a song or two of hers, but not many.","What are some of her popular songs?","She did that song that was really popular years ago called \"Rehab.\"","Oh yeah, I remember that song.","What are some others?","Some of her other more well known songs include \"Back to Black.\"","I'm not sure if I know that song or not.","How many albums does she have?","She unfortunately only has a couple of albums, since she passed away at a young age.","That is sad.","I definitely want to check them out though.","You should.","They're both really great, but also very different.","How are they different?","Well the first one is like a jazz hip","hop mix, which is really cool.","But it has a more jazzy feel to it.","And what about the second album?","Her second album is a bit more experimental in my opinion.","Her sound changes a bit but she plays around a lot with melodies.","That is very cool.","What is your favorite song of hers?","Well I can't choose just one.","But some include Wake Up Alone, Me and Mr. Jones, and Some Unholy War.","I'll have to listen to those.","I wonder what kinds of music she listened to.","I think she was influenced a lot by the type of music she listened to, but I know she loved Frank Sinatra and Donny Hathaway.","Are they jazz singers?","Frank Sinatra is, but I'm not sure what genre you'd classify Hathaway as.","I want to check them out, too."]},
{"tag": "Eminem", "patterns":[ "Do you like Eminem?"], "responses": ["Yes I listened to him a lot growing up.","What was your favorite song of his?","Growing up it was I'm sorry mama.","I remember that one.","Now days I like rap god.","That's a lyrical masterpiece.","He really showed his skills with that one.","I've seen a bunch of videos of people trying to rap along with the song.","How did that go?","Well nobody was able to keep up but a couple of them were impressive.","He's in a league of his own.","Did you like any others?","The real slim shady please stand up.","That's a classic.","Wasn't Brittany Spears still singing then?","Yep they were the two big singers at that time.","At was in the 90s right.","Yes it was think early to mid 90s.","Do you think Eminem will produce another album?","I hope so."]},
{"tag": "Blind", "patterns":[ "What do you think of Blind Guardian?"], "responses": ["I'm not overly familiar with them, which genre are they a part of?","They started out as a power metal band, but over the years they have become more progressive.","Sounds interesting, do you have any albums to recommend?","My favorite album would have to be Imaginations from the Other Side.","It's one of their older albums.","Sounds like I should check them out.","They are also an amazing live band, such energy on the stage.","Sounds awesome.","Another band Blind Guardian is similar to would have to be Iced Earth.","What makes them so similar?","The music style and their lyrics are inspired by myths or fantasy.","Could you give any examples of fantasy inspired songs or albums?","Iced Earth actually made an album dedicated to the comic book character Spawn.","The album is called The Dark Saga.","Will have to check it out for sure.","Considering you say they are so similar have the bands ever worked together?","In a sense they have.","John Schaffer and Hansi Kürch made a band called Demons & Wizards.","Is the band any good?","If you enjoy either Blind Guardian or Iced Earth I think you would like Demons & Wizards.","Has Demons & Wizards released a lot of albums?","Only two as it's just a side project for the two musicians, but there were some rumors that they were working on the third album.","You've given me a few new bands to check out.","Thanks for the recommendations."]},
{"tag": "Paramore", "patterns":[ "Have you heard Paramore's new album, After Laughter?"], "responses": ["I haven't had a chance to listen to the whole album but I've heard a few songs.","A lot of people say it's completely different from their other stuff.","Do you like what you've heard so far?","I really liked the first song they posted on their Facebook, Hard Times.","I'm still not too sure whether I love Told You So or not.","I think Hard Times was definitely different than what I was expecting, especially with Zac Farro rejoining the band.","I do like it better than Told You So but I love the reasoning Hayley Williams gave for the song.","I haven't seen any interviews about Told You So, what did she say about it?","The gist of a few articles was that, because they've been so unsure of whether there would even be a new album after Jeremy Davis left, she always has this feeling that everyone around her can see the warning signs even though she can't.","So everyone's waiting around to say they told her so when things go badly.","I can see that.","I got that it was about people assuming they were right and saying they told you so but I didn't really think about it in relation to the band.","I do think the sound is different compared to their other albums but I think that's one of the things I love about the band, really.","Yeah, they started out pretty young, right?","I hadn't heard about them until The Singles Club and then the album, Paramore, came out, so I didn't know they'd gone through a couple rotations of band members.","I really didn't see Davis leaving the band again.","It seems like there's an explosion in the band, they regroup, remember that they love what they're doing and they want to keep at it, and then they put out a new album.","You have to figure that the sound and vibe of each is going to be a bit different just based on that alone.","I think all bands that stick together for the long haul end up having some progression in their music and vibe.","Unless they decide to stick with what works in the band and then do their own solo thing to explore anything else.","I think so too.","I know that the Farro brothers were supposed to be leaving in order to pursue another band but I'm not sure whether Taylor York or Jeremy Davis have done their own things.","Hayley has down a few solo things but it's usually a feature for another artist.","I remember her being featured in that B.o.B song, Airplanes.","A couple of others, too.","It'll be interesting to see what happens after they've toured for this album.","They've been a constant for me since 2006 so of course I'd hate to not see another album from them but I also hate that there seems to be so many problems.","I feel like there's always a fair amount of songs with each album that concern whatever the drama was.","At least with the self titled album and this one, anyways.","Yep, there was some pretty pointed shade on the self titled album.","I guess that's why everyone was so shocked that Zac came back; it's hard to believe that Jeremy leaving was even more contentious and tense than the brothers leaving.","Still, they've made really catchy songs that stick with you.","I mean, they've got talent and Hayley is a great singer so you have to think that she'll probably stick with it no matter what.","They re very catchy.","I'm not sure if I've fallen for any of these songs as hard as I fell for Native Tongue or Still Into You off of 2013's album, Hard Times has been the catchiest for me so far.","I think I'll probably go back and listen to their old stuff just so I know what people are talking about concerning the change.","I vaguely remember hearing one or two of those songs, maybe seeing the music videos."]},
{"tag": "Julia", "patterns":[ "Have you heard of the new song by Julia Michaels?"], "responses": ["Which one is that??","And I don't think I know who she is.","It's called \"Issues\" and she performed it at the BBMAs.","Oh that's her?","I love that song!","Yes, she's a new artist but has been around for awhile as a song writer.","Really?","Who has she written songs for?","She has written songs for Justin Bieber, Selena Gomez, and Britney Spears!","What!","That's insane!","Yes, she apparently wrote Justin's \"Sorry.\"","I love that song.","What did she write for Selena?","Julia wrote \"Good For You\" for Selena.","Another hit!","I wouldn't have thought.","She is incredibly talented.","I applaud her work.","I agree.","I'm glad she has a new song now for herself.","You're right, now she's in the spotlight.","She did fantastic at the BBMas.","I can't wait for new songs!","Me too, I will definitely be on the lookout for her.","I wonder when she'll release her next hit!","There should be one coming up this summer I hope.","I'll be keeping my radio on!"]},
{"tag": "music", "patterns":[ "what was your first concert?"], "responses": ["I think It was raffi.","That's is funny.","okay , what was second or most impactful at a young age?","I think my second may have been new kids on the block.","Was that the most impactful?","I know it is cheesy but they had a big impact on my younger self.","I recall all the hysteria around them.","My sister was obsessed.","Most people , well young girls like joey because of his blue yes and baby face, also the youngest.","But I like Jordan Knight.","I think my sister had a barbie of him.","I had it too.","what was her favorite song or yours?","Well I will admit to enjoying some of the songs back in the day.","oh ya?","closet New kid fan?","Like what specific tities?","Hangin' tough and everyone liked step by step.","Both great tunes in my book, Don't be embarrassed.","No guy really admits they like boy bands.","Well maybe some.","Well what is your favorite boy band?","I would say 'n sync or backstreet boys, they were popular when I was in highschool.","Of course I adore them as well.","So many memories get linked to certain songs.","True, I recall vivid images at a school dance while bye bye bye played.","That was a great one.","Seeing the videos brings back tons of memories too.","such iconic moves."]},
{"tag": "What", "patterns":[ "What kind of guitars do you like?"], "responses": ["I like fenders.","Why?","There are plenty of reason.","Give me your top 3 reason.","They have a rich sound, the guitar necks are thin, and a classic body.","That's true.","What kind of guitars do you like?","I love the classic Gibson.","Led zipplin used Gibson's.","That's why.I saw how that liked on stage and sounded live, and I feel in love.","They are just as good as fenders.","I'm selling one.","Really?","Would you like to buy it?","Not really.","Listen to zipplin tonight and you'll change your mind.","I'll check it out.","Also,check out Jimmy Hendrix.","Ok I will"]},
{"tag": "Hey", "patterns":[ "Hey, how much do musicians charge to play at weddings?"], "responses": ["You're getting married?","Yeah, next spring.","What are you looking for?","We're thinking either a small brass band or a string quartet.","They'll either charge by the hour or by the day.","I was hoping to pay them in exposure.","Don't do that.","Why not?","It's incredibly insulting to music and those who dedicated their life to it.","How so?","It's background music.","You'd pay a DJ.","You pay Taylor Swift when you hear her concerts live.","Yeah, but I don't have much money.","Let me tell you something: \"pay by exposure\" is crap.","No one can survive on that because exposure never did anything to anyone.","Of course it does.","No, it doesn't.","It devalues the musician because now people know they'll play for free, and won't pay them either.","Sorry, but I don't have the money to pay for musicians.","Then create a playlist and have someone hook it up to a sound system.","Okay, sorry.","Don't be so rude.","Well, you're a chef.","If someone said \"Cater my dinner.","Pays by exposure\" you'd laugh in their face."]},
{"tag": "What", "patterns":[ "What is your favorite music genre?"], "responses": ["I would have to say rock & roll from the 60's.","Who is your favorite singer from that era?","No question, Elvis.","Why do you like Elvis.","Because he can sing any kind of song.","What is your favorite Elvis song?","Can't Help Falling In Love.","Do you have a second favorite song?","Yesm Just Pretend.","How about a third favorite Elvis song?","In The Ghetto\nAny other singers you like from that era?","Yes, I really liked Neil Diamond.","What is your favorite Neil Diamond song?","Sweet Caroline.","How about a second favorite Neil Diamond song?","I would have to say Kentucky Rain.","Who is your favorite group from that era.","No question, it would be the Beatles."]},
{"tag": "Okay", "patterns":[ "Hey lets talk about music\nOkay i love music\nWho doesnt?"], "responses": ["Right\nWhat do you listen to.","It depends on my mood\nSame here\nI like a little bit of everything\nExactly\nInlisten to a lot of country and pop music though\nI love country music\nMe too, people say its depressing but i dont think ao\nMe either, its a great genre of music\nI completely agree\nI really like rascall flatts and lonestar\nThose are good bands\nI dont think theres any country i dont like\nPretty much i really like mark chestnut and mindy McCready\nI love them too\nGood talking to you"]},
{"tag": "Kendrick", "patterns":[ "What do you think of Kendrick Lamar?"], "responses": ["I think he's good, not sure if he's as amazing as everyone says.","Oh?","I think he's amazing.","Why do you say that?","I just don't see what he's doing that hasn't been done before.","I don't know if he's completely changing the game, but you have to admit he is unique.","I suppose.","Unique does not equal great, though.","True, but Kendrick has great lyrics, great technique and mass appeal.","There are a couple of tracks I like, like \"Swimming Pools.\"","\"Swimming Pools\" is great because it's a deep and thought","provoking song disguised as a mindless club hit.","Yeah, I kind of get that.","What do you think about \"HUMBLE.\"","his recent single?","I think it's fine.","Nothing special.","\"HUMBLE.\"","is interesting because it's the opposite of \"Swimming Pools.\"","What do you mean?","Well, \"Swimming Pools\" is a deep song that sounds like a mindless song, while \"HUMBLE.\"","is a mindless song that sounds deep.","I guess you just kind of assume all Kendrick Lamar songs have deep meanings.","If you listen to the lyrics, \"HUMBLE.\"","is basically just Kendrick bragging about how awesome he is.","Not much to it.","Maybe I should listen more closely to his lyrics.","He's very clever in the way that he puts things together.","I'll keep that in mind."]},
{"tag": "What", "patterns":[ "What are your thoughts on metal music?"], "responses": ["I enjoy it.","It has a lot of different sub","genres.","It does.","Some of them are too extreme for me.","Yeah, I don't listen to the really extreme stuff.","So then what's your favorite metal band?","I really enjoy Metallica.","Metallica is awesome.","They are.","The Black Album is my favorite.","That's the one with \"Enter Sandman\" on it, right?","Yes, that whole album is amazing.","My parents used to play that song all the time.","Mine did too.","I think that's why I like it so much.","They actually have a lot of hits.","They do.","I think they're the best at sounding heavy but still being catchy.","Yeah their music gets really heavy at times.","Their guitar solos are awesome too.","Kirk Hammett can shred for sure.","A lot of the guitarists from back then were very talented.","They were.","Dimebag Darrell was another one of my favorites.","He was very good also.","I wish I could play an instrument like that."]},
{"tag": "Awesome", "patterns":[ "Lets talk about music\nAwesome i love music\nMe too\nWhat do you like\nI have always love country music\nCountry music is great\nThats what you listen to also?"], "responses": ["Yes\nIve always wanted to see gsrth brooks in concert but have never been able to\nSame here, i have his recorded concerts that i watch\nI have watched his concerts too\nThey are fun to watch\nYes they are\nI hope he does more concerts\nMe too\nHis tickets were impossible to get last time\nI know i tried so hard\nMe too it was ridiculous\nI didnt know that many people liked him\nMe either"]},
{"tag": "The", "patterns":[ "Do you watch The Grammys anymore?"], "responses": ["I watched it the other night.","I watched it but I swear there are so many artists today that I have never even heard of.","I did like that Adele won for Album of the Year for 25.","She has a beautiful classic voice.","She would sound gorgeous in any era.","Personally, I'm not a big Beyonce fan even though everyone loves her Lemonade album.","My son actually had to do a homework assignment about Lemonade!","Wish we had homework about the Beatles when I was kid.","I actually like some of the new music.","I totally miss hearing The Fugees.","I thought their remake of Killing Me Softly was better than the original.","Lauren Hill is so underrated.","Did you ever hear her remake of \"Can't Take My Eyes Off of You\" the old Frankie Valli hit?","It's awesome.","Yes.","I love it when I'm surprised by a remake of a popular song.","You always think it's going to be worse, so you are blown away when it's good.","Just goes to show you that you can't prejudge till you hear it.","You have to keep an open mind.","I have to confess, I don't always do that.","Can I give you another example?","Don't tell me you love rap music because I won't believe you!","Well, when I first heard a version of Rehab by Amy Winehouse, I liked the song, but then when I heard the mix with Jay Z, I thought it was incredible.","That shocks me.","I  figured you for strictly old school.","I liked that version but some of the lyrics turned me off, think there was some profanity.","I think that so much rap music would have a broader audience but for the language.","That doesn't mean it has to be \"Gettin Jiggy With It\" by Will Smith\nYeah, some of Tupac Shakur's music was powerful without the bad language.","Well, it certainly seems that for two older ladies, we have fairly broad taste in music!","Well, when my kids come over at least I know who Lady Gaga is, I guess that's progress.","I feel like the artists that are the best like Adele or Lady Gaga know they owe a debt to the older artists, like Tony Bennett.","Well, that Cheek to Cheek album they did together was pretty good.","Tony Bennett is 90 years old so guess we can all learn something new about music!"]},
{"tag": "John", "patterns":[ "Do you like John Mellencamp?"], "responses": ["I do, but it's not without reservations.","What do you mean?","He writes some incredibly good songs that I love deep down inside, but he's really hit and miss.","So what do you do, just listen to greatest hits compilations?","No, my choices don't match up very well with theirs.","I have an iTunes playlist that I made of my favorite songs by him.","Good idea.","If I wasn't so lazy, I could do that with a few different artists that I feel that way about.","I recommend it.","You know, there's a funny thing about him ","","\nPlease don't tell me that story about when your sister's friend met him AGAIN.","No, no.","I was going to say that it seems like his music matures almost in sync with me.","He grows and changes just when I do.","Hmm.","Well, I guess I kind of see what you mean.","I can't listen to anything before Scarecrow without it being a pure nostalgia trip.","Yep, me too.","And Scarecrow is starting to go that way for me now.","Favorite album from him?","Mine's Human Wheels.","I guess Mr.","Happy Go Lucky, but it's a little hard to day because even that one only has so many I songs on it that I like.","I love that song Empty Hands.","In a way it could be heard as a Christmas song,  but it's really so much more.","Agreed.","It's excellent.","And it shows something about him which I love, his concern and support for the common people.","True, true.","Farm Aid and all.","Right.","I think they still do that.","Me too.","But I don't like to think too much about his personal life.","Oh, I agree.","All that smoking and so many marriages."]},
{"tag": "Have", "patterns":[ "Have you ever heard of death metal?"], "responses": ["Yeah, that's the music where the just scream.","Pretty much, but it's got some good rock music to it.","I don't really like death metal.","What kind of rock music do you like?","I'm more of a classic rock person.","I love classic rock, too.","I think classic rock is the best rock music.","It really is one of the better types of rock music.","I think there is something they captured in the 60s and 70s that can't be recreated.","I wonder what it is about that time period that made music so good?","I think it was the culture of America and how it was changing.","I guess a lot of songs are about the changing of the culture.","Another thing was unlike today you didn't have to be a model to be a musician.","Yeah Janis Joplin wasn't the prettiest woman but she had some jams.","You can hear her pouring her soul out in Me and my Bobby McGee.","That's another thing that's missing, singers actually feeling the lyrics.","It's hard to feel the lyrics when someone else wrote the song for you.","There really aren't a lot of singer songwriters anymore.","I don't think anyone writes their own songs anymore."]},
{"tag": "Hey", "patterns":[ "Hey, do you like 80s music?"], "responses": ["Yeah, I do!","What are some of your favorites?","Well, I really like Madonna.","Her early stuff was great!","I like Madonna, too!","What your favorite song by her?","Wow, that's a hard question.","I guess it depends on my mood, but \"Like a Prayer\" is really good.","What about \"Vogue\"?","Oh yeah, that's a great one, too!","I've always liked her slower songs.","\"Crazy for You\" is really romantic.","Tell me about it.","My older sister used that as her wedding song.","Really?","Yeah, she fell in love with it the first time she ever heard it.","That's really sweet!","Have you heard any of Madonna's newer stuff?","Yeah, but I don't like much of anything she's done since 2000.","I totally get that.","It's always fun seeing her with younger performers though.","You mean like Britney Spears and Lady Gaga?","Yeah.","I like watching those performances, too.","She's definitely a big influence on the female singers who came after her.","Agreed.","She's a legend."]},
{"tag": "music", "patterns":[ "what type of music do you listen to?"], "responses": ["I tend to listen to more pop or top 25 hits on the radio\nwhat's your favorite song out there right now?","It's called shape of you.","it's a pretty catchy tune.","that's cool.","who is the artist?","Ed Sheeran is the artist behind the song.","What's your favorite music?","I like classic rock myself.","that's cool.","I grew up listening to that in the car.","I tend to love Billy Joel.","What's your favorite song by him?","I like the uptown girl.","that's a great song.","one of my favorites by him for sure.","My wife and I do Karaoke and this is our go to song!","that sounds like a lot of fun.","How often do you go to the Karaoke bar?","we usually go about once or twice a month.","It just depends on what we have going on.","I haven't been since college.","you should come with us next time we go.","that would be a lot of fun.","You want to go this weekend?","I can't do it this weekend.","Maybe next weekend\nokay.","sounds good"]},
{"tag": "Nicki", "patterns":[ "So, what do you think of Nicki Minaj?"], "responses": ["Oh, I like her music, just not her videos.","Did you see the one for Anaconda?","Yeah, I liked most of it but couldn't watch it with my little sister.","I didn't like the lyrics.","She sure is pretty, though.","I like when she gets together with other singers, like when she sang with Jessie J in \"Bang Bang.\"","Oh, yeah, I like that song, too.","DIdn't they both sing with Ariana Grande?","Yup, all three got together on stage with \"Bang Bang.\"","Ludacris did a song with Nicky singing, too, yeah?","Yup, that was \"My Chick Bad\", back in 2010.","She also sang in \"Monster\" with Kanye!","I love her lips, I think they're great.","Her lips and her huge booty, but she's pretty proud of her booty.","That's because she's not oddly shaped; everything matches up well on her body.","So, what's her latest song out now?","Well, she dropped 3 new ones back in March:   \"Regret In Your Tears,\" \"Changed It,\" and \"No Frauds.\"","Yeah, Lil Wayne sung with her on \"Changed It\".","She was talking to Remy Ma Beef when she rapped, \"\"Tried to drop 'Another One,' you was itchin' to scrap / You exposed your ghostwriter, now you wish you were scrapped / Heard your pussy on 'Yuck,' I guess you needed a pap / What type of bum bitch shoot a friend over a rap,\"\nI definitely love some hip","hop.","Yeah, Nicki Minaj is one of the best."]},
{"tag": "What", "patterns":[ "What's your favorite heavy metal band?"], "responses": ["I have a few but Metallica, Pantera, and Tool are my favorites.","I've always been a huge Pantera fan.","Same, but the band was never the same after Dimebag Darrel was killed.","Oh man I know.","Dimebag Darrel is without a doubt the greatest guitarist of all time.","Dimebag could shred better then anyone in the world.","Phil Anselmo is also one of my all time favorite vocalist.","I love Phil.","The entire band had some serious personal problems.","I think drugs played a huge role in the band's demise.","Couldn't agree more.","Those guys loved to party.","I still drink Blacktooth Grins in Dimebags honor on occasion.","What's a blacktooh grin?","It's a drink that Dimebag Darrel created, still somewhat very iconic in the heavy metal world.","I've never heard of it before, do you know how to make one?","Yeah!","It's a double shot of Seagram 7 and a double shot of Crown Royal on ice, splashed with just enough Coca","Cola to give it a darkened look.","I'm going to make one rite now and jam to some Pantera.","Do it brother!","What's your favorite Pantera album?","Cowboys from Hell!","That entire album is insane.","Cowboys from Hell is also one of my favorites but their album Vulgar Display of Power is my favorite.","Don't get me wrong, I love Vulgar Display of Power but the album is a little too heavy for my liking.","I know what you mean, it's not the easiest album to listen to.","You have to be into that heavy bass sound to really enjoy the album to the fullest.","RIP Dimebag Darrel, I think Pantera is greatest heavy metal bands of all time.","I'm torn between Pantera and Metallica, I can't pick one or the other.","I love them both equally."]},
{"tag": "music", "patterns":[ "I am looking for a good music documentary to watch, seen any?"], "responses": ["I always enjoy watching Eight days a week, a beatles documentary.","Is that the ron howard film?","Yes they go into the background of the beatles and their tours.","Ya  it is good, but have seen it.","Any others?","Well have you seen searching for sugarman?","No what is it about?","Well I hate to spoil it for you  so I will be vague.","A musician and twist of fate.","Intriguing.. so mysterious\nI would say more but it would be like someone spoiling sixth sense for you, in my opinion.","Fair enough.","Where can I find it online?","I know it was on netflix for a while, just search I am sure you can find a copy somehow.","Do  you have any suggestions yourself?","Well I really was engrossed by gypsy caravan.","I think that is the title.","Follows a bunch of different clans of musician gypsy's.","I think I have seen it.","It was really good.","There is so much passion in the music and the voice of the one old lady is so incredible.","Ya  I am always moved when I hear that style.","Have you seen the movie HANNAH?","No, What is it about gypsy's?","No not really, based around a girl mainly.","But there is one seen that features gypsy music I found that scene very moving.","I will have to check that out too.","Thanks.","No problem.","Always glad to share my musical taste and thoughts."]},
{"tag": "King", "patterns":[ "Hey, I heard you're a King Crimson fan!"], "responses": ["Oh, yeah, totally.","Early period, of course.","What's your favorite album?","Larks tongues.","I'm a total fan of Jamie Muir!","Oh yeah, same here.","He was amazing!","I always figured Fripp got rid of him because he took the Limelight.","Well, how couldn't he?","He played like a madman!","And he was so incredibly\nMy favorite is lizard.","I just love the horns!","Same here!","I never really liked horns that much until I heard the album.","Now I'm crazy about them!","I think Fripp is crazy to take down his albums when people post them to YouTube.","I totally think people are more likely to buy them if they get to hear them.","It's not like you get introduced to King Crimson randomly.","I agree!","I have sent links to their albums to people, and they have told me that they actually went ahead and bought them.","Whose lyrics do you like best?","Sinfield or Palmer James?","I love them both!","I think sinfield was a great producer, and they should have had him produce all their albums.","I totally agree.","Do you totally love Fripp's guitar playing on Eno's albums?","Oh, man, I do!","His solo and Baby's on Fire is just beyond words!","I completely agree!","I really regret getting rid of all my albums.","Those King Crimson albums were so well made period the covers were so beautiful, and they simply don't look as good in CD format.","They sound better, but they don't look as good!","You got rid of your albums?","I was going to, but luckily, my husband wouldn't let me.","If it weren't for him, I wouldn't have mine anymore.","Lucky you!","My wife and I were reading a lot about Japanese tea houses, and we were seriously going in for minimalism in 1992.","Still are, but I regret getting rid of some of my albums.","I can dig that.","They do take up a lot of space.","I should probably get rid of at least some of mine.","I if you get rid of it you wish you still had it.","If you don't get rid of it, you will never need it or want it again!","Anyway, Crimson is awesome!","So cool to meet another fan!"]},
{"tag": "music", "patterns":[ "I kind of like classical music, but am unsure about what 'classical\" music actually is."], "responses": ["Well, what kind do you like?","I really like those big pieces for orchestra.","So maybe you like Romantic era music?","What's that?","Pieces of music that were usually written sometime between 1830 and 1914.","Wow, I had no idea.","So would Tchaikovsky be Romantic music?","Absolutely!","Well, I do like his Piano Concerto.","What else would I like by him, you think?","I bet you'd probably love his Symphonie pathétique, his sixth symphony.","What's so cool about it?","Lots of stuff.","It's in a minor key, b minor, so it sounds really dark and sad.","And it has really nice writing for low register instruments like cello.","Okay, that sounds promising.","Also, there's a lot of debate about whether there's a \"secret\" program associated with this piece.","Like whether Tchaikovsky was trying to tell some sort of specific story through the music.","Cool.","Have they ever proven that in any way?","No.","In fact, Tchaikovsky didn't even call it the Pathetique at first—that was only added right after he died.","Interesting!","When did he die?","Right after this piece premiered!","That's another reason people find it interesting.","It's sort of his last great hit.","Whoa, people were obsessed with that kind of plot line even in the 1890s?","Oh yeah, we've been obsessed with dramatic stories about music for a long time!"]},
{"tag": "Let", "patterns":[ "Let's try something music","related."], "responses": ["Okay.","Open your iTunes to your general library.","Got it.","Now, scroll up and down a bunch of times with your eyes closed.","Then, select a song and tell me what it is.","\"Whistling in the Dark\" by They Might Be Giants.","Who are they?","They're a satirical pop band from America, just two guys.","I don't recognize their name.","Have you heard \"Istanbul (not Constantinople)?\"","Yeah, I think so.","That's them!","Is there anything else I'd know?","They've only had five songs chart in the US, and \"Istanbul\" wasn't one of them, ironically.","Really?","that's odd.","Have you heard \"Birdhouse in Your Soul?\"","No, I don't think so.","That was their big hit, it reached number 3.","Do they still tour?","Yes, they're crazy popular, but kind of a cult band."]},
{"tag": "Taylor", "patterns":[ "I went to the James Taylor/Carole King concert last night."], "responses": ["How was it?","I couldn't make it.","Oh, it was really great.","I've seen James Taylor a few times before this, but never Carole King.","I've never seen her either.","What did you think?","I enjoyed her a lot more than I expected.","She did some of her hits and some old Goffin and King songs.","Cool.","I think I would enjoy that.","The chemistry between them was great.","I guess that makes sense.","They are old friends.","Yes, they are.","You know how James Taylor always seems so warm and accessible in his concerts?","Yes.","Well, she is the same way.","It felt like an evening spent chatting with the two of them and 10,000 fans.","What songs did he do?","He did some that you would expect like Walking Man, Carolina in my Mind and Fire and Rain.","What else?","He did Sweet Baby James and he told a story about writing that song for his baby nephew.","I was glad to hear that, because I always thought it was odd to write that about himself.","I always thought that, too.","Did he do any more obscure songs?","He did.","He did that Millworker song tha tI really love.","I love that, too.","Did he do Steamroller?","Yes, he did.","I have really never liked that song for some reason.","Really?","I love it."]},
{"tag": "Wilburys", "patterns":[ "I heard a song by the Traveling Wilburys today."], "responses": ["They are great, I love that band.","They had some great musicians.","Yes they really did.","Yes, Tom Petty, Bob Dylan, George harrison and Roy Orbison to name a few.","They could really harmonize.","Sure Could.","One of my favorite songs was End of the Line.","I think the band was started by George Harrison, one of the Beatles.","I think so.","What are some of your favorite songs they did.","Well I love Handle with Care.","That is a good one.","Roy Orbison really had a great voice.","They all did!","Tom Petty is one of my favorites.","I think they put out three albums.","Yes I believe so.","I am not sure if Roy Orbison was on all three, I think he passed away after the second one came out.","He may have.","George Harrison and Bob Dylan were great as well.","Yes, that was a great band.","Full of some of the great musicians!"]},
{"tag": "Yeah", "patterns":[ "So I bought the old pink cd\nYeah I have that one it's great."], "responses": ["Yes.","I love her song like a pill\nShe has an awesome edgy voice\nI agree.","You can tell she puts her heart and soul in her songs\nLet's get back to the boy band era\nYeah boy bands.","I remember them.","Especially nsync\nThey were like a phenomenon\nYup.","My least favorite boy band was lfo.","I know right.","They sucked.","They only had a one hit wonder\nHa.","I remember dancing to vanilla ice too.","Ice ice baby was a classic also\nWho would you say is the best rap artist\nI'm keen to 2pac.","He had such a flow\nI listened to the around the world with my boyfriend the other day\nThat song will most definitely get you moving\nIt reminds me of the blue song\nI think the blue songs music video is funny\nYeah it glitches out.","They are like crazy blue aliens"]},
{"tag": "What", "patterns":[ "What's the best kind of music to dance to?"], "responses": ["For me, it would be R&B.","I like something a little more up","tempo.","Fair enough.","When it comes to dancing music, I think R. Kelly is top of the heap.","And I'd rather listen to something like Katy Perry or Kesha.","We have very different tastes in music, to put it mildly!","A lot of people put down Kesha, but her music is really dance","able.","I am not her biggest fan, but maybe you're right.","I just like something smoother.","R&B is definitely smoother, but there's not as much energy in it.","I think it's energetic, just a different type of energy.","Yeah, i guess maybe 'energy' is the wrong word.","Maybe excitement?","Again, I'd say it's excitement of a different kind.","The bottom line is that I'd rather listen to 'Roar' or 'Warrior' than any of R. Kelly's songs if I'm in a dancing mood.","And for me, songs like 'Ignition' and 'Imma Flirt' are sure to get you moving on the dance floor.","I do like 'I Believe I Can Fly' by R. Kelly, but that's not much of a dancing song.","No, I agree.","R. Kelly does songs that are more inspirational than dance","able too.","I guess I mostly enjoy the inspirational ones.","Whereas I think the inspirational songs get a litle bit corny at times.","Yeah, next time we're driving somewhere, I'm controlling the radio dial!","We'll see about that!"]},
{"tag": "Hi", "patterns":[ "Hi."], "responses": ["Hello.","How are you doing?","Well, how are you?","Doing good.","That's good.","You into music?","Yeah I like music.","See any good shows lately?","I went to a concert a few weeks ago.","Oh yeah?","Who did you see?","My girlfriend and I went to go see Chris Stapleton.","Oh really?","I love that guy.","Yeah he was great.","Did he play all the songs you wanted to hear?","Yeah he played it all.","How long was the show?","It was about 2 hours.","That sounds like fun.","It was."]},
{"tag": "Nickelback", "patterns":[ "Do you know the band Nickelback?"], "responses": ["I do!","I hate that band!","Why do you hate them so much?","I just think their music sounds awful.","Have you heard their newest record?","I have.","It is terrible!","What is the name of the album?","It is called \"Welcome To The Machine\"\nWhat record label released it?","I am not sure.","I just know that I didn't like it.","Isn't the band from Canada?","I always thought they were American.","Nope.","I think they are from Alberta.","Are they popular in Canada?","They might be!","But I think they are more popular in America.","What is the name of the lead singer?","He is my least favorite member\nChad Kroeger is the lead singer.","He was married to Avril Lavigne, right?","That's correct.","They are divorced now though.","I'm sorry to hear that.","But I still do not like him or the band."]},
{"tag": "West", "patterns":[ "Man, you've got me increasingly addicted to early West","Coast punk\nHa."], "responses": ["I am victorious.","I just got a bunch of X's backlist","","it's really hard to search for that band with a one","letter name!","Yeah, but maybe that's just to be punk rock and difficult?","Maybe, or maybe it was just the early eighties and nobody had ever thought of being Google","search friendly.","Did you check out TSOL?","I loved the TSOL you lent me.","I don't like it as much as the Germs, but it's great for blasting at red lights.","Doing our part to counteract the hiphop and garbage radio pop, one power chord at a time.","I checked out a band that's supposedly kind of in the same food group.","Have you ever heard of the Flesh Eaters?","The name is familiar but I'm having a hard time thinking of a particular song.","Is it kind of...sounds like the Ramones more than the Sex Pistols?","Yeah, that's it.","I think I like the heavier less friendly sound.","You need to check out the Diesel Queens.","You'll laugh yourself silly.","It's more modern but unlike most of the pop that gets called punk in the last couple of decades it's actually punk.","I'll definitely check that out next, I'm still filling in all the punk I was too busy not being born to listen to!","I was there and I'm still catching up, but I'm getting into more modern acts that I think still have that punk soul.","Right now I'm crazy about a band called Nazis From Mars.","I've heard of that!","I think they call that eight","bit punk, it's punk but it sounds like they played half of it using Atari sound effects?","That's them!","Female vocalist, I think she might be French from her accent.","They did a cover of I Wanna Be Sedated by the Ramones that's so much better than the original.","Honestly I know we're required by some kind of subcultural law to like the Ramones, but I never really did except for THAT song.","It's too radio friendly.","And since a friend of mine said, \"It sounds like the Beach Boys,\" I'm unable to hear anything else.","Oh my God, you're right, it DOES sound like the Beach Boys.","See?","And that's not a compliment for a punk band.","Or honestly for any band except the Beach Boys.","Well, the Beach Boys sounds like....old fifties rock, as in when it was still really called rock and roll.","It's just too vanilla for me.","Too safe, it's like I can hear the musicians fantasizing about all the radio play they're going to get, which is the opposite of punk."]},
{"tag": "music", "patterns":[ "I was listening to the classic rock station the other day, great stuff."], "responses": ["I like that station, they play music from the 70s and 80s.","Back in the old days, my favorite band was Led Zeppelin.","Zeppelin four was the best album.","Even though it didn't have an actual title!","Plant went on to sing in the honedrippers, but that didn't last.","I know, but Page is still the greatest guitarist ever.","Maybe, I saw Clapton back in 92.","He is considered on of the best.","Yeah.","old slow hand was great.","He did MTV unplugged.","Nowadays, music isn't the same.","The last group I liked was green day!","Seriously though, there are no great new rock musicians these days.","Now it's pop and hip hop.","All music sounds like Katy Perry.","Although I do like Lady Gagas voice.","She did some great stuff with Tony Bennett.","That was crazy","what a weird pairing that worked.","My kids listen to some hip hop stuff, but they all have weird names.","Well, so did the old groups.","I used to listen to Ratt and Red hot chili peppers so it's all good.","That's true.","It was just easier to remember names like Michael Jackson!","and Prince!","Wow, so many great ones are gone!","I miss Freddy mercury, let's listen to some Queen!","Ok, Bohemian Rhapsody coming right up!"]},
{"tag": "Moby", "patterns":[ "I wonder what Moby has been up to lately."], "responses": ["I saw him in a magazine a few months back.","I don't think he's making any new music lately.","No I doubt it.","I wonder how long he's been vegan.","He's very skinny and pale so I'm guessing a long time.","I wonder if his veganism had any effect on his music.","I'm sure subconsciously it did.","True, his music was always very light and peaceful.","Much like his attitude towards animals I'm guessing.","I wonder if he ever used any animals sounds in his songs.","That would have been cool.","Trance music with animals sounds would be cool.","A lot of the tones in his trance music could resemble animals sounds already though.","True, maybe that's what he was going for.","I wonder if his music was actually designed for animals.","How do you mean?","Like what if he made trance music to help animals relax.","Interesting theory.","Go get the dog, let's see if he likes Moby's music."]},
{"tag": "Is", "patterns":[ "Is music a good topic to talk about?"], "responses": ["Yes i love music\nGood so do I\nWhat do you listen to when youre in the car?","I have sirius radio\nOh okay, i used to have that\nSubscription ran out?","Yes and i havent had the money to get it back yet\nThat sucks\nYea but ive been listening to iheart radio\nWith Bluetooth?","Yes i love the favorites station it puts together for me\nYea i listen to iheartradio sometimes\nIts the best way to listen to music for me\nI like it better than pandora\nMe too, i dont like pandora\nIm glad we agree\nIt was nice talking to you\nYou too\nBye"]},
{"tag": "My", "patterns":[ "My son is in need of a new tuba."], "responses": ["Aren't we all?","Cut the jokes.","What am I looking to pay.","Well, I need to know a few things.","Ask away.","How old is he, how serious is he about it?","He's 17 and going to college for music education, and already has a performance and academic scholarship.","Nice!","Congrats to him.","Thanks!","He wants to be a band director some day.","Okay, so looks like he's serious and won't need a 'school' instrument.","Yeah, something professional but not too expensive.","Do you know if he wants rotary or piston valves?","Which sounds better?","They sound the same.","The only real differences are appearance and that rotary springs back faster, but it's not noticeable, really.","Probably rotary then.","Silver, nickel, or brass finish?","Brass, for sure.","CC or Bbb tuning?","Whatever is most common.","For him, probably a Bbb tuba.","Try a St. Petersburg 202N, it's a bit under $4,000."]},
{"tag": "What", "patterns":[ "What is a good type of music that will pump me ?"], "responses": ["I like drum and bass.","What is that?","It is a type of electronic music.","Can you tell me more about it?","It is very fast and uses drums and bass alot.","That sounds cool.","How is it electronic?","There are also synthesizers.","Interesting.","How do I start?","I would start by looking up some artists.","Who is a good one?","Klute is a very good one and has been around for awhile.","Cool.","So how do these people perform?","Usually what happens is a DJ plays their songs together in a mix.","What is a mix?","A mix is a combination of songs that seamlessly merge into eachother.","That sounds awesome.","It is.","It will put you into a trance, and you will be what they call, \"locked\".","How have I never heard of this?","This usually happens in the underground and online.","Check out jungletrain.","It is an online radio station."]},
{"tag": "The", "patterns":[ "Have you ever heard of the band The Eagles?"], "responses": ["I have.","I really like their music.","It's tough to pick a favorite song but I'd have to say mine is Hotel California.","What is yours?","I like that one too but to be different I'll pick Life in the Fast Lane.","Whenever I hear that on the radio and I'm driving I always end up driving way too fast!","Me too!","They have a lot of great songs and you know, they are still great today.","I know what you mean.","I think it is because each member of the band is super talented in his own right.","The songs they wrote back in the day could really touch your soul.","They were real too.","They were about stuff everybody goes through not like the music out there now.","I hear you on that.","I brought them up because I heard that they are going on tour again soon.","Even after Glen Frey's death?","Who'd they get to replace him as if anybody ever could?","They actually got his son to do it.","I think that is very very cool.","Definitely.","I would love to hear how he sounds.","I hope he can sing just like his dad.","They are also tapping Vince Gill to tour with them.","I bet he'll do the songs with all the high notes in them.","I bet you are right.","I wonder if they'll release a new album or at least a new song or two.","I don't know but if they do I'm sure it will be great!","I hope they do it in rock style instead of country."]},
{"tag": "Aerosmith", "patterns":[ "What do you think of Aerosmith?"], "responses": ["They are a great band\nI know.","Steve Tyler is great.","I have liked them since the 90's.","It's hard not to.","Steve Tyler has a great voice.","Their overall sound is great.","Do you like Guns N' Roses?","Yes, of course.","What is your favorite song from them?","Patience\nWhat about Aerosmith?","Mama Kin\nThat is a good one.","I like Chip Away at the Stone\nI love that one a lot.","Which band do you like better?","Aerosmith\nI agree.","They are better.","Do you Slash?","Yes, He is an amazing guitarist.","So is Joe Perry."]},
{"tag": "Metallica", "patterns":[ "Have you listened to that new Metallica album yet?"], "responses": ["Wait..Metallica relseased a new album?","First time I'm hearing about this.","Have you been living under a rock?","Yeah, it's their tenth album.","What's the name of the album?","Is it any good?","The album is called \"Hardwired... to Self","Destruct\" and it's not as good as like Ride the Lightning but it's not terrible either.","That's kind of disappointing to hear, the last album Metallica relseased was back in 2008.","They had almost 10 years to make something great.","Chill out man, the album isn't that bad and plus I was comparing it to Ride the Lightning which is the greatest Metallica album ever made.","Umm you really think Ride the Lightning is the greatest Metallica album ever produced?","I'm assuming you don't agree?","Heck no!","Do you even listen to metal bro?","Master of Puppets blows Ride the Lightning out the water.","Dude Ride the Lightning has a much better selection of good songs.","Master of Puppets is alright.","I can't even have this argument with you rite now, do you even know who Cliff Burton was?","Ofcourse I do dude, Cliff was the bass guitarist for Metallica, wasn't Master of Puppets his last album?","Yeah it was, he was killed in a bus accident while Metallica was touring for the album.","That really sucks, but I'm still not changing my mind about Ride the Lightning being better.","You can't overlook the song quality of Fade to Black, or For Whom the Bell Tolls.","I do love those songs but how are you going to overlook Master of Puppets being certified 6× platinum?","Ummmm Ride the Lightning was also a cetified 6x platinum album dude ha.","Really?","Well I never knew that.","Now you do.","Plus  Ride the Lightning was the last album featuring Dave Mustaine..","I guess that's why I never liked the album.","I hate Mustaine."]},
{"tag": "Scott", "patterns":[ "OMG Have you heard Scott Stapp is touring?"], "responses": ["Who?","I can't place the name.","He's the singer from Creed!","Oh yeah.","He is touring alone without the rest of the guys?","Yeah he just finished a tour for his solo CD.","Now he is doing a live unplugged tour.","Oh man that sounds great!","Yeah, I saw him on the solo tour he sounds great!","Really?","He was really messing up.","He did some really weird stuff.","Yeah he went to rehab and is doing much better now.","He sounds great, awesone show.","We should try to go.","I would love to see a live unplugged show.","Yeah and they are recording each show as it happens and you can buy it and take it home that night!","What!","Thats awesome!","Yeah.","nobody has ever done that.","He is really trying new things Very cool!","He is also the new singer for Art of Anarchy.","He took Scott Weiland's place\nReally?","Now that sound good.","Interesting mix of talents.","I love Bumblefoot.","They just release a new CD called The Madness.","There are 2 videos out already.","How did I miss this?","I need to go listen on Youtube.","You really do it's really good.","Go listen, let me know what you think, they will be touring soon too.","I am I am.","We got to go to a show man NO DOUBT!"]},
{"tag": "Green", "patterns":[ "Do you know if Green Day still makes music."], "responses": ["As far as I know, they do.","I haven't heard anything from them recently.","True, it's been a while since I've heard something from them.","The last song I remember is \"Know Your Enemy\", and I believe that came out in 2009.","Wow, that song came out that long ago?","That's almost a decade ago.","For real, time has flown.","Just think, it's been over 20 years since Green Day came on the scene.","Yes, back in the days of High School.","I still remember when Basket Case came out.","Yes, 1994, I believe it was.","They took off right after Basket Case and made hit after hit for the next decade.","Some hard following fans would suggest they sold out.","I prefer to think they made it big.","They seemed to get too political also sometime in the middle of the 2000's.","I hate when artists become political.","For real.","I think that the whole American Idiot album was a backlash against George W Bush.","It was around that time of the 2004 election and many people saw the album as a movement for the left.","They had a few good hits on that album.","That seems to be their last big album that I remember.","Maybe the politicizing of their music really turned people off.","Could be a possibility.","Not to mention they are getting older as well.","True.","I do miss their older stuff.","I love the beat to their music.","It is good music to go jogging or exercise to because of the rhythm and beats.","Really?","That makes sense though.","I'll have to put some of their music on my playlist next time I go for a jog."]},
{"tag": "Weatherbox", "patterns":[ "Have you ever heard of a band called Weatherbox?"], "responses": ["I have not.","Tell me about them.","They are one of my favorite bands.","They are from San Diego, California.","What type of music do they play?","Their style varies, but it is a mix of rock and alternative and indie.","Are there any famous people in the band?","There are not any famous people in the band.","But the lead singer is amazing!","What is his name?","Brian Warren.","He is the main songwriter of the band and one of my favorite musicians ever.","Does the band have a record deal?","They originally had a deal with Doghouse Records & later with Triple Crown Records.","Those are two really cool companies.","The band must be great.","They really are.","It makes me sad that many people have not heard of them.","What is your favorite album they put out?","I would have to say their very first album.","What is that record called?","The title is American Art.","It is unlike any other record I have ever heard.","How did it not become more popular in that case?","Music is very subjective.","Not everybody likes the same thing.","You're right.","Hopefully some more people begin to discover this band soon though."]},
{"tag": "Christmas", "patterns":[ "Who is your favorite Christmas singer?"], "responses": ["Well, my husband likes Mariah Carey.","I mean traditional Christmas singer.","Then it's a toss up between Bing Crosby and Bing Crosby.","LOL.","There were other singers besides Bing Crosby.","Not on the eight tracks my parents owned!","What about Nat King Cole?","Oh yeah.","And that guy in the sweaters?","Perry Como?","Yes, he sang some Christmas songs.","I like Mariah.","I like Manheim Steamroller.","And I like choirs singing hymns.","Like the Mormon Tabenacle Choir?","Yes!","I had them on VHS as a kid.","Hey, eight track is more old school than VHS.","What about songs from claymation specials?","Ah, nothing can beat the Heat Meiser and Cold Meiser songs!","I like the Island of Misfit toys.","I liked Burl Ives as the snowman.","And I liked Shirely Booth as Mrs. Santa.","But, I do agree that Bing Crosby was the bomb on Christmas songs.","Especially his version of White Christmas."]},
{"tag": "Loerde", "patterns":[ "What do you think about the new Loerde album?"], "responses": ["I think it's ok, I wasn't blown away by it though\nI really, really, like it!","And pop music isn't usually my thing but I think this album is really good!","I do like how she does more experimentation on this album.","I'll give her that.","I'm surprised by your lukewarm reaction.","I thought you'd feel the same way I do.","I mean, its not terrible.","Overall I'd say it's a good album but not an excellent one.","Personally, I'm blown away the whole album is electrifying.","I actually get goosebumps on some songs.","I do appreciate her storytelling, I think she has a true gift for words.","Exactly, if she didn't pursue a career as a musician,I think she could have one as a writer.","Maybe she'll do both.","It wouldn't be the first time a musician has crossed over into writing.","True, but I think she likes to use music and her voice to emphasize the words.","What's your favorite track?","Sober II (Melodrama), for sure.","It is the perfect way to start closing out the album.","I liked that track a lot.","I don't understand why she didn't end the album with that instead of Supercut and Perfect Places.","Yeah, she definitely should have switched the order.","Supercut, then Perfect Places, and ending out with Sober II.","Well, she's still new to all of this, but I feel like a producer should have noticed that.","Yeah, it really distracts from the story she is trying to tell.","What is your favorite track?","Probably Liability.","I feel like it was so raw and full of emotion.","I completely agree, the lyrics are almost haunting.","I think she's really going to go far in the industry.","She's got talent, I feel like she just needs to fine tune it a bit."]},
{"tag": "Devin", "patterns":[ "You ever hear of Devin Townsend?"], "responses": ["nah, what band is he in?","He used to be in Strapping Young Lad "," really popular industrial metal band from the early 2000s.","Oh word, that sounds familiar.","Didn't they break up?","Yeah, he wanted some creative distance from such an angry outlet so he started a solo career.","What kind of stuff does he make now then?","He dabbles in alot of genres "," alot of melancholic rock in his early career but now he does ambient stuff, a country album, prog rock...\noh wow, reminds me of Ween a bit then.","Alot of genre","hopping...\nYeah, that's accurate.","He has some consistency between projects though so they blend together really well.","So should I start at the beginning with him then?","Definitely.","Start with Ocean Machine "," it's really heavy and sludgy and the best entry point.","Word.","And I should just go chronologically from there?","I think so, his career has a specific trajectory that comes to light if you follow it from the beginning.","If you dive in at the end it'll seem really strange.","Strange how?","Because of the cross","genre approach?","Well yes, but right now for instance he just finished a space opera starring puppets, and is going from that to a symphony.","Oh wow, so it's a little tricky to figure out what the heck is going on unless I follow his work from the beginning?","Yeah exactly "," he has alot of recurring themes and in","jokes in his work that make his chaotic later output make way more sense.","Gotcha, so listen to his stuff chronologically and pay attention to how things progress.","What's the reward in all of it?","You'll laugh, you'll cry, you'll scream "," it's some of the craziest, most passionate, and inspirational music out there today.","Haha well alright then, I'll get started now."]},
{"tag": "Have", "patterns":[ "Have you ever been let down by a concert?"], "responses": ["No why have you?","Yes, I feel the last counting crows concert I attended kind of sucked.","why ?","In what ways?","Well I felt the song you truly are waiting to hear like round here were re worked in a way that was barely recognizable.","That does suck.","I actually feel artist should be more open to the big hits that made them popular in the first place.","Yes, they are sometimes so reluctant to play fan favorites but I don't get why.","Well not all bands are like that.","Thanks goodness.","Maybe I have just had some bad luck.","If it has just been one counting crows concert experience It is not bad at all.","If only that was the only time.","I went to a jefferson airplane concert this past summer.","Guess what they choose not to play?","white rabbit?","No they did play that one at least.. but Nothing's gonna stop us.","It was one of the reason I wanted to go at all.","That sucks since it is one of the bigger hits for them but so different from their usual sound.","I agree it was an 80s hit for them for mannequin the movie.","But being one of their biggest hits they should have played it.","Did they play rock that city?","That was another big one.","Yes.","I guess they played two of the three songs I really wanted hear live.","I guess they hated that song, or are embarrassed by their 80s phase like many people.","I get that , it is true they don't like playing that song.","But I still find that to be wrong, celebrate what you are loved for.","I do agree with you.","I hope that all your future songlist wishes come true."]},
{"tag": "You", "patterns":[ "You know who I find to be kind of a funny artist?"], "responses": ["Who is that?","Taylor Swift.","Why Taylor Swift?","Well, she herself is not that funny.","The fact that she started out as a country singer and has transitioned to the pop star she is today.","I hardly remember her as a country singer.","I know, it is easy to forget considering all the pop success she has had.","Right, I mean I can't name one country song she did.","It is hard to listen to her music today and find even a tiny hint of country style in there.","I would never have known she had country roots if I was not a country fan anyways.","Yes, I think anyone who doesn't listen to country music would have no idea.","Didn't Miley Cyrus sing some country as well?","I think she dabbled in it, but she has kind of always been a pop person.","Speaking of Miley, I really like her new song \"Malibu\".","Oh me too.","I feel like she is going back to where she started out a little.","Yeah, she got unique there for a little bit.","She did, and it overflowed to her music.","I really like that song though.","I hope she keeps making more songs like that.","I think she will given the reception it is getting.","I guess all young people have to go through a \"unique\" stage."]},
{"tag": "Duke", "patterns":[ "Woah, have you heard Duke Ellington's 40s music?"], "responses": ["Oh, yeah, I have.","It's just downright incredible.","The early stuff with Blanton on bass and Webster on sax is mind blowing.","Yeah, I had Jack the Bear as my ringtone for a while.","Oh, that's awesome!","Yeah, I figure it's attention grabbing, but won't annoy people on elevators.","I'll bet they loved it!","What's your ring tone now?","Pow R Toch by Pink Floyd.","Chhhhhh chhhhh.","Chhhhh chhhhhhhh.","Doy doy!","Doy doy!","Exactly!","It's fabulous.","I love it!","I'll have to change my ringtone.","What are you going to change it to?","I don't know.","I'll have to think about it.","Maybe Singin' All Day!!!","Oh, that's a great choice!","Will you use Tull's or Tommy Dorsey's.","Now that's a hard choice!","Which version did you hear first?","Dorsey, if you can believe it!","I'd heard a lot of Tull, but not that song!","Oh, that's great!","So you heard Jo Stafford rocking out in the 40s, and then Tull's version?","Yes.","I couldn't believe it!","It's amazing how much groups harken back and transform things.","Yeah, I love the part in it when Tull sings, \"Is that her in the fur coat, no it's not December yet, my my my.\"","Yeah, and I love the part where he sings, \"I sing very softly so if the phone rings ....","I can hear it...I can hear it!\"","I love that, too!"]},
{"tag": "Nightwish", "patterns":[ "Have you heard the new Nightwish CD?"], "responses": ["Yeah, I just got it!","What do you think of it?","It's good, but different.","I think that's because they got a new lead singer.","I was unaware.","They fired Tarja.","Do you know why?","Artistic differences I suppose.","So who is the new chick?","I'm not sure, I'll have to google her.","Her voice isn't as controlled as the previous singer.","I agree, she's not as good.","She's good, just not as good as Tarja.","Yeah Tarja is amazing.","I wonder what she is up to now?","She has a solo career.","That's cool, I'll check her out.","You should, she's amazing.","Thanks for letting me know."]},
{"tag": "What", "patterns":[ "What are you listening to?"], "responses": ["I can hear it through your headphones but can't place it.","What!?!","Take off the headphones!!!","You don't have to yell.","There, they're off now.","What do you want?","What are you listening to?","It's a group called ELOY.","Never heard of them.","Who are they?","Ask your dad.","Oh, alright, I'll tell you.","They're a progressive electronic new","wavy kind of rock band from the 80s.","Man, I wasn't even alive in the 80's.","There was music back then?","Sure.","The instruments were wooden but they made them work.","Instruments?","They're what people played music on before computers.","Eloy was drums, guitar and heavy on the keyboards.","How do you hear the singer with all that noise?","Well, the idea is that the singer sings along with the music.","They are integrated together.","Let me listen.","Wow.","That's trippy.","It's hard to listen to.","It confuses me.","Do I really want to ask?","Alright.","Why does it confuse you?","It's too busy.","There's too many sounds at once.","You mean too many notes?","Yeah, that's it.","What's a note?","Go boil your head."]},
{"tag": "Elvis", "patterns":[ "What is your opinion on Elvis Presley?"], "responses": ["I know a few of his songs, and him of course, but not all of it.","He had a much wider range than he gets credit for.","Really?","Like what?","He did a lot of gospel.","Really deep, spirituals, old hymnals.","I did not know that, like what?","How Great is Our God, for one.","But he did it in the southern style.","I like when some singer do hymnals, it can be really touching.","Carrie Underwood does a few and it is really just beautiful, even if you are not into christian music.","I think it is the emotion they convey.","I like the Elvis song, about a pocket full of, is it Rainbows?","Pocket full of Rainbows?","Oh, yeah that was a really good one.","I like his deeper ones.","Like what?","In the ghetto.","It is a cover, but he did it well.","Really moving.","I know his other one, Hound dog.","That one was cute, everyone seems to like it.","I like the way he sounded.","It was so happy and free.","He had his own voice, no one could replace it.","Do you think his later stuff was any good?","Like Hey Jude?","That one, was that not a Beatles song?"]},
{"tag": "Grateful", "patterns":[ "So did you watch the Grateful Dead doc on prime."], "responses": ["I did.","I love their music, man.","What's your favorite song.","Man, it's not about just the song.","It's the performance too.","Not for me.","I love American Beauty.","Good album.","But Friend of the Devil at Chicago on April 9, 1985 is the best.","Friend of the Devil is good.","I like Candyman.","Man, Candyman is awesome.","\"Mr Benson, I see you're doing well\"\n\"I went down to Memphis where I learned to talk a jive.\"","Robert Hunter is a great lyricist.","He was like the fifth Beatle of the Dead.","He was definitely enlightened.","Yeah, but he needed Jerry, man to make the music and sing the lyrics.","Jerry's voice was something else.","A wise angel.","Weir aint bad either.","He's all we got now and that's pretty good.","Have you seen Dead and Company.","Man,let me tell you about April 11, 2015 in St. Louis..."]},
{"tag": "Mars", "patterns":[ "Bruno Mars moved up on the Billboards Chart again with his latest song."], "responses": ["Which song is that?","That's What I Like is now number 3, peak performance of the song was number 1.","Bruno is pretty cool, his music is very catchy.","It's hard not to dance with his music.","I know!","Yeah, his song has been on the charts for 22 weeks now.","I am sure he has some awards for his performances over the past few years\nHe has won BET Award for Video Director of the Year as one of them!","I think he also won Teen Choice Award for Single Male Artist too.","What are some of your favorite songs of his that he has done?","Uptown Funk/Formation is one of all time favorites, a great dance song!","When I Was Your Man is also fantastic, I have it on my playlist today.","I bought his album 24K Magic, it is fantastic.","I think Versace on The Floor is on that album, right?","Yeah it is, I love that one.","When was 24K Magic released to the public?","I think it was November 2016.","Did you have to buy it early?","Yes, it had already sold out before I even could get it.","Wow, how long were on the waiting list?","I think about 3 weeks."]},
{"tag": "music", "patterns":[ "I will!"], "responses": ["I'm not a big fan of alternative indie","pop.","Really?","What are you a fan of?","Well, I guess I like Indie in general.","Who's your favorite artist?","I love Regina Spektor.","I've heard of her.","She does the intro song for Orange is the New Black right?","Yup!","All of her albums are amazing.","I only know a few songs.","Well what other kind of music do you like?","I listen to a lot of Jazz.","Oh really?","That's cool.","Yeah, I love instrumentals.","That's awesome.","My father is a big jazz guy.","Who did he listen to?","He really loves Miles Davis.","Oh yeah, he really knows how to work a trumpet.","I agree!","He's a legend.","You can't forget about Duke Ellington.","He's another legend.","Yes!","My grandma has all of his work on vinyl.","Wow, she's really a fan."]},
{"tag": "Here", "patterns":[ "Here we go."], "responses": ["Have you ever heard of the band Phish?","Yes, and ew that's gross.","I know, I know.","This band is notorious for being prejudged.","It's just that their fans are so weird.","Yes, I actually am very annoyed at their concerts when dealing with certain people.","Then why do you even like them?","Because every second of it is incredible and worth the trouble.","What in the world is so good about them?","It's the excitement that is derived from their approach from playing.","What is so special about their approach?","Well most bands come out and play the songs the same way each night they perform, correct?","Yeah, and where are we going with this?","Well, Phish does have rehearsed sections, which are still loose.","Yeah, those folks are loose alright.","And then there are open sections for improv.","How does that work?","Well, there's a chord structure, underlying rhythm patterns and a melody from the rehearsed section of the song.","And with those elements, a story is told?","Exactly, but the story is created right in front of you.","Wow, I get it.","I think I see the light."]},
{"tag": "Johnny", "patterns":[ "Do you like Johnny Cash?"], "responses": ["I do.","But I do not know a lot of his music.","He is probably my favorite artist.","Why do you like him so much?","He is an excellent songwriter and I love the tone of his voice.","What are a few of your favorite songs?","I really like the songs Man In Black & All I Do Is Drive.","I have actually heard of those tracks.","They're great.","What else do you know about Johnny Cash?","He inspired a lot of country music musicians.","That is true.","I also know that they put out a movie about him and his life.","Yes, it was called Walk The Line.","That is also the name of a song, isn't it?","It is!","That is one of his most popular songs.","A lot of artists have covered it over the years I think.","You're correct.","The artist Halsey did a cover a few years ago.","Cool!","That probably opened up the song to a whole new audience\nYou're right I think.","I bet a lot of her fans had not listened to a lot of Johnny Cash music.","I thought the same thing!"]},
{"tag": "Madonna", "patterns":[ "I've been really into listening to Madonna again lately."], "responses": ["She is a bit underappreciated lately.","I know.","I mean, I know her older stuff is still pretty popular, but her newer work should get more attention.","Well, it's not all good.","True.","The last album could have been trimmed of a few songs, but most of it was pretty great.","Yeah.","Dance music in general always has a tough time in the US though.","It's true, every time it seems like it's starting to really break through, it sort of fades away again.","It did seem like it was having a moment there.","Seems to be all back to rap now though.","Mostly.","Though there are still some acts that crack the charts.","The Chainsmokers have been doing pretty well for themselves.","And Zedd and Kygo have managed some minor hits recently.","Unfortunately, they all border more on pop than real dance music.","At least the radio hits do anyway.","Well, The Chainsmokers especially don't really make what I would call dance music, it's very pop.","True, though the same could be said for Madonna.","She is definitely a pop act, but much her output is far dancier than The Chainsmokers.","That could be what's been hurting her though.","That is what I was getting at eariler.","Well it is what it is.","Things don't need to be hits to be able to enjoy them.","No, I suppose not.","If that were the case no one would even listen to rock music anymore."]},
{"tag": "music", "patterns":[ "have you heard the remix for black and yellow?"], "responses": ["which \"black and yellow\" wiz khalifa or Damian?","Wiz\nno, never even knew it has a remix out already.","man you have to listen to it,he had like the whole hiphop head on it.","like who?","snoop dogg, drake,2chains,french motana,lil wayne and t","pain on the hook.","oh my days that's like a bunch\nthey all delivered and the remix was slayed.","damn i need to hear this one,would purchase asap on apple music like now.lol\nyou should man, you love rap music and a crazy 2chains fan so you'll dig it.","of course i am so eager to listen because of 2 chains\noh i did forget to put ricky ross on the list,he took the last rap.","what tha!","Ricky on it too.","oh yeah he had this line that says \" now i am getting salute from rappers i respected\".","hahaha seems he's throwing shade at someone.","i wouldn't see it that way, i probably feel he meant he's getting respect from other rappers he has respect for as well.","sounded like a diss to me though lol\nman this is how fans create beef that wasn't there at the first place.","hahaha that was just my thought."]},
{"tag": "Has", "patterns":[ "Has there ever been a song that made you cry?"], "responses": ["Oh, definitely!","Yeah, me too.","Music has that ability to make me emotional.","I'd probably say that there a lot of songs that have made me cry.","I listened to the song 'I Will Always Love You' by Whitney Houston right after my mom died, and I cried like a baby.","Yeah, that's one of the things about music "," if it hits you in the right way, it can devastate you emotionally.","So, what's the song that's most provoked that emotion for you?","Hmm, I'm not sure I can think of one.","So then what's one example?","OK, I can think of one.","It's probably a slightly weird one.","I doubt it's that weird.","What is it?","I was listening to the Talib Kweli song called 'For Women', and at the end, I started to cry.","What made you cry?","The song just gave me so much empathy for people for whom the world has been unkind and cruel.","I've never heard the song.","Most people probably wouldn't have that reaction.","I probably wouldn't have had that reaction, most times.","Yeah, I can understand that.","The music hit you in exactly the right way in the moment.","It's interesting, the connection between music and emotions.","It's an intense thing!","It's good to talk about it, though."]},
{"tag": "Ludacris", "patterns":[ "Do you think you will come see Ludacris this fall with me?"], "responses": ["No I really don't think I will get the time off to see him.","That stinks.","I really hoped you would get to hear some of the songs you listened to back in the day.","You are telling me!","I love Ludacris!","I think that TI is going to be there with him too.","You really think so?","Maybe I'll skip work.","I think you should.","It is a once in a lifetime concert.","I really love the CD Red Light District.","Yeah I have had that CD playing in my car all week.","It is so amazing!","Do you think I could borrow it to get in the mood to go to the concert?","Absolutely!","I really love track 2, Number One Spot.","That is my favorite too.","It was all over the radio back in the day!","Do you think we could use your connection to get back stage at the concert?","Oh I think I could talk to him.","He usually likes to trade free spots back there for some music!","What kind of music does he like?","He really loves alternative rock music!","That is kind of weird for a guy who is always at Rap concerts!","I'll look and see what I have around the house.","I will look too.","I think I have a whole box full of CDs he would want.","Great!","I think this will be the greatest night of our lives.","I can't wait to go to this concert with you!","You really convinced me!"]},
{"tag": "What", "patterns":[ "What song are you completely embarrassed to love?"], "responses": ["My god, I have so many.","You first.","No, you first.","Fine.","\"Livin' la Vida Loca\" by Ricky Martin.","HAHAHAHAHAHAHA.","Yeah, yeah, you said guilty pleasure, so you can't laugh at it.","Why do you like it?","I mean, it's ironic that it's a gay man talking about a crazy woman he's in love with, but the music is great and upbeat and fun to listen to.","I can't stand his valley girl accent of sorts.","I hate how his cadence.","Yeah I can understand that.","So, yours?","Ready for it?","It's bad.","I'm totally excited.","\"Spice up your life\" by the Spice Girls.","See?","I'm not laughing, it's respectful.","Thanks!","Hilarious, though.","That song is awful\nYou lied!","Come on, The Spice Girls are super generic and nothing happens in their music.","It's fun to listen to.","It is, but the lyrics are a bit distracting.","They don't match the harmonies."]},
{"tag": "Hey", "patterns":[ "Hey, man."], "responses": ["You heard of a guy named Brendan McClean?","No?","Who is he?","He is a singer based in Europe.","UK I think.","Oh yeah?","What kind of music does he write?","It's very lgbt friendly.","I think you would really like him.","He has a song called Stupid.","Are you saying that song is baout me?","Haha!","nooo!","But it does remind me of your ex.","HAHAHAHA!","That's too funny.","Where did you hear about this guy?","From a pidcast call WElcome to Night Vale.","OH!","I know that one.","The play songs during The Weather.","YEAH!","He was in one of the earlier ones.","That's cool.","I will totally have to check him out.","For sure.","There are lots of cool artist that are featured in WTNV\nI know it.","I have found a lot of cool new music to listen to.","They even have ones from different countries.","Yep.","You ever heard a French dude rap?","No.","But that sounds awesome.","It was.","I have no clue what he was saying but I was digging it.","I will check them out.","Do that."]},
{"tag": "What", "patterns":[ "What is your favorite music genre?"], "responses": ["Rock\nWhy do you like it?","I love the sound.","Do you like rock from the 50's?","Yes, I love it.","Who is an artist you like from the 50's?","Bobby Vinton\nWhat is a song of his you like?","Blue moon\nI have heard that one.","It is good.","Why do you like it?","The melody is great.","I like the melody too.","I love 50's rock.","Do you like modern rock?","Yes, but not the newer stuff.","What stuff do you like?","I like 90's rock.","What bands?","Pearl Jam and Bush"]},
{"tag": "music", "patterns":[ "I love listening to the radio and zoning out with the music on the way home from work!"], "responses": ["I know!","Music brings up so many memories, doesn't it?","Yes!","Especially when I hear the positive songs from my teen years.","Oh to hear the hair bands screaming about lost love.","Definitely makes you think back to that first crush, first school dance, summer vacation, and lots more!","Right.","And then when the rap songs come on, those always remind me of fun times too!","Back when rap was real.","I know!","2Pac, Biggie, Eazy","E, Dr. Dre, and Snoop rapped about truth!","Now we have posers that just say what sounds tough.","Ridiculous!","And then sometimes I flip the station to the older songs that my parents always listened to on the radio when I was young.","Oh yes!","Air Supply, Brian Adams, and the Beach Boys for me!","Definitely all of those!","Plus The Eagles, Elvis, Reba, The Oakridge Boys, and Alabama.","Doesn't it make you feel almost like you're a little kid again?","Yes.","Sometimes I can remember the smells or where we were going when a certain song was played.","Music transports me back in so many ways!","Do you listen to more of the older stuff?","Or do you listen to today's popular music too?","Oh I listen to it all!","I have a 21","year","old and an 8","year","old, so they keep me hip and young!","It's just not the same as what we liked back in the day.","No, not at all.","I used to have my bedroom walls covered with all of the hottest hair bands.","Groups like L.A.","Guns, Motley Crue, Guns n Roses, and Skidrow.","Oh Sebastian Bach from Skidrow!","Man he could sing and he was so good looking with that long, shiny hair!","I think I had a crush on every one of those guys in them bands back then!","To be young again!","I am going to have to start listening to some of my older favorites.","I found myself listening to jazz today and almost couldn't believe it myself!","Yes, our music taste evolves as we age, but I relish every genre these days.","Classical and jazz can be soothing for the soul.","I agree and my day was particularly stressful, so that's probably why I turned it on and zoned out to it."]},
{"tag": "What", "patterns":[ "What do you think about show tunes?"], "responses": ["I love them and can't ever get enough.","Have you heard the soundtrack to Hairspray?","I haven't heard that one.","What song do you like the best?","You Can't Stop the Beat\nWhat do you like so much about it?","I love the beat!","I could clean house to it all day.","Who sings it?","Zac Efron and John Travolta if you can believe it.","They aren't the only ones though.","Are they any good?","Surprisingly, they are.","The whole cast is amazing!","I will have to give it a try.","Once you start listening, you will be singing and dancing right along.","I'm not much of singer or dancer, so I doubt that.","I bet you are wrong.","I don't sing or dance either, but You Can't Stop the Beat makes me move.","Maybe it would help me get my house clean also.","Did you know that Amanda Bynes and Queen Latifah sing also?","You're kidding me!","I had no idea.","I highly suggest you listen to the whole soundtrack, but if you are in the need for a pick","me","up, listen to Can't Stop the Beat\nI think I will do that.","It sounds amazing."]},
{"tag": "What", "patterns":[ "What kind of music do you like?"], "responses": ["I'm up for almost any, but no rap or country.","OK, have you heard of Airborne Toxic Event?","No, what kind of music do they play?","I would classify it as alt rock.","Do they have any songs out.","They are kind of an indy band, I've only heard one song of theirs on the radio.","And it is???","It is called Sometime Around Midnight.","It is an amazing song.","What makes it so amazing.","Well it tells a story.","What kind of story.","A story of seeing an old lover one night.","Sounds good.","Man it is so good, you can feel the emotion from the song.","I'll have to check it out.","Yeah, you should see the performance they did on Letterman.","They were on Letterman?","Yeah a few times.","So they have a few songs out then."]},
{"tag": "Music", "patterns":[ "The lineup for this Music Midtown concert is awesome!"], "responses": ["Nice!","Who is playing.","A lot of people but Bastille to be specific.","Oh yeah, they are good.","Are you going?","I'm unsure so far.","I really want to.","What's stopping you?","The tickets are a little expensive.","You will figure it out.","I just checked out the complete list!","And there are so many good artists.","Yeah?","Who do you like on there?","Young the Giant, Manchester Orchestra, Big Sean, and Future\nOh wow.","I didn't realize that Future was going to be there.","I know!","That's huge.","I really want to go now.","Same here.","I can buy tickets, I just wasn't sure if they were worth the price.","They definitely are.","I'll go with you if you're going\nSounds good to me.","Have you heard the new Weezer music?","No, not yet.","They will be at the concert, maybe I will hear it there.","You have to listen to it before!","That's the best part\nTrue, I just don't have enough time to listen to so much new music.","I'll send you a list of songs that you need to listen to.","Sounds good!","Thank you."]},
{"tag": "Pitbull", "patterns":[ "What do you think of Pitbull?"], "responses": ["Isn't he a rapper that does some hip hop music too?","Yeah that's him.","He has a new song that is pretty good.","What is the song of his called?","It's called Options and it's a collaboration song that features  Stephen Marley.","Sounds cool.","I will have to check it out for sure.","Do you like any other songs by Pitbull?","Well I really liked that one that he sang with that Ke$ha girl.","You mean the song called Timber?","Yeah that one.","It was a really good song and I like how upbeat Pitbull's music is.","What's your favorite Pitbull album though?","Hm, I think my favorite one is Climate Change.","The explicit one though of course.","Well if you like Pitbull, Do you like Bruno Mars?","He's that guy who did the Grenade song right?","Yeah that's him.","I love that song too.","Same but my favorite song of his is Just the Way You Are.","Oh I know another Hip Hop and R&B artist you might like.","Oh?","Tell me more about them.","Yeah their name is Jason Derulo.","He did that song In My Head.","Oh yeah I remember him.","That song is really good too."]},
{"tag": "Wind", "patterns":[ "Did you go to the Wind Symphony concert last night?"], "responses": ["Of course!","I always go.","Thanks for supporting us!","No problem, I love the kids at this school.","What did you think of the Maslanka Symphony?","Honestly, you all played it super well, but I hate his music passionately.","Really?","It's deep and religious.","I get that, but it doesn't mean it's good music.","What was wrong with it?","Well, his music has no true structure.","Sure it is, it's theme","and","variations.","Kind of.","His music is very ADD, and there are other issues as well.","What's wrong with that piece specifically?","Well, it's too in","your","face sectional theme","and","variations.","There's no subltety.","Anything else?","The clarinets blowing on their mouthpieces in the middle made no sense.","It was 'weird for the sake of weird'\nYeah, I wasn't a fan of that.","But what about the brass?","The brass part was great, I loved it, but of course it was just a slow major scale.","Did you meet him after the concert.","I've met him before, actually, so I left."]},
{"tag": "Do", "patterns":[ "Do you like chris stapleton?"], "responses": ["Yes he is really talented\nHe is\nDo you have his new album?","Which one?","From a room volume 1\nNo when did it come out?","May 5\nOh okay i didnt know he had a new one out\nIts good\nI bet i need to go get it\nthere's going to be a volume two\nWhens that coming out\nAbout a year\nOh okay that sucks\nYea thats a long time to wait for another volume\nExactly\nI wish it was sooner\nMe too\nHope you like it"]},
{"tag": "Beatles", "patterns":[ "Which band is better, the Beatles or the Rolling Stones?"], "responses": ["Oh man, the age old question of Classic Rock!","Yep, this is the big one!","I know what I'd say, but curious about your opinion.","I've got to go with the Beatles.","Interesting.","I'd say the Stones were better.","Heres why I say Beatles "," With the Beatles, you've got Lennon and McCarthy, two of the greatest songwriters of all time.","It's true that the Beatles benefited from their separate geniuses, but for me the Stones were more consistently great.","The Beatles turned out some weird stuff, but you can just ignore it if you want to.","Their hits, though, can't be topped.","You want hits?","The Rolling Stones have a few hits of their own.","They do, but I don't think they match the Beatles for range.","Sympathy for the Devil, Satisfaction, Brown Sugar "," the list goes on.","Sure, but did they ever make a song like Eleanor Rigby?","Maybe not, but they made a lot of great songs.","So did the Beatles, and I'd argue their songs were greater.","The Beatles are a great band who is also overhyped.","I don't think it's possible to be overhyped when you're the greatest band ever!","Says you!","I'm going with the Rolling Stones.","The Stones are Top 5, for sure Maybe Top 3.","Same for the Beatles.","Great, but not the greatest.","We'll have to agree to disagree."]},
{"tag": "Sr", "patterns":[ "Do you remember that one pop punk band called Sr","71?"], "responses": ["I think so.","Didn't they do that song called Right Now?","Yeah that's them.","I liked that song a lot.","It was very catchy.","Yeah they are pretty good except I feel like they ripped off NOFX.","Who's NOFX?","They are like this christian punk band.","I will have to check them out.","Are they pretty good?","They are but they are an older band.","That's cool.","How did SR","71 rip them off though?","Well if you listen to some of their songs you'll notice similarities in tunes.","Really?","I never realized that.","Yeah but both bands are still good.","What about that one band New Found Glory?","What about them?","Whatever happened to that band?","Man I don't know they just stopped being popular I guess.","Weird.","I liked their music a lot especially that song My Friends Over You.","Yeah that one was okay.","Some of these groups remind me though of when Simple Plan was all popular.","Oh yeah I remember that Emo Pop Punk band."]},
{"tag": "Despacito", "patterns":[ "Hey, what do you think of the \"Despacito\" song on the radio?"], "responses": ["Ugh!","Don't even talk to me!","What?","It's a great song.","Yes, it's a great song.","But get Justin Bieber outta here!","My take on it is, he's bringing Latin music to a wider audience.","Maybe, but he ruined the song!","He can't even speak Spanish.","Do you really thing the song would be as popular without Bieber?","Maybe not, but good music doesn't have to be popular with every teenage girl.","Okay, then, what's a Latin hit that the U.S. should be listening to?","Chino & Nacho all the way.","They're a Venezuelan group who have been popular in Latin America since 2008.","Do you have a song recommendation?","I'd like to listen to more Latin music.","\"Andas En Mi Cabeza\" is a song they did with Daddy Yankee.","\"Niña Bonita\" is another favorite of mine.","I think actually I've heard those with my Colombian friends.","Probably!","They're very popular in Colombia too.","Okay, so I'll drop the Bieber version of \"Despacito\" and listen to some better music.","You better!","What other genres of Latin American music do you listen to?","Well, I lived in Ecuador for a few years, so I like traditional Andean music.","Check out \"Maria Chun Chun\"!","I'd like to get to know the hits and more regional music, as well.","That's a good take on it.","People listen to a mix of everything!"]},
{"tag": "music", "patterns":[ "I went to the mall the other day, and stopped into the music store."], "responses": ["Did you find anything good to take home?","Well, I did find a Michael Jackson collection of his songs on sale.","Was it expensive?","Yes it was.","Even on sale , some of these collections can be pricey.","What are some of your favorite Michael Jackson songs?","Bad, We Are the World, I Just Can't Stop Loving You are some of my favorites.","Man in the Mirror is my favorite , as well as Bad.","They had a $5 coupon off the collection price, so I bought it.","I like to go into Barnes and Noble music section to find new music too.","Do you have any of Michael's music albums?","I have Bad, Xscape, and One Night in Japan.","Dangerous was won of my favorites that he had out.","Yes , I don't know how many awards he had over his lifetime, but it was amazing his career.","It spanned decades.","I wonder if his children have any talent like he had.","I have not seen any of them take up music much yet.","We will see, they are quite young as of yet.","Michael will be missed.","Yes, forever."]},
{"tag": "If", "patterns":[ "If you could see anyone in concert who would it be?"], "responses": ["Anyone at all?","Yes anyone.","That's a hard choice because I like a lot of artists.","Maybe the Backstreet Boys.","I heard that they've been playing a lot in Las Vegas lately.","Yes I think you're right I saw that on Facebook.","Another artist I always wanted to see in concert was Boyz 2 Men.","But they're old school.","I loved their music back in the 90s.","Yes their music made me cry on a few occasions.","Which song of theirs was your favorite?","I loved \"One Sweet Day.\"","Yes that one made me cry the most!","So sweet though.","If you were looking for music to make love to I also love the \"I'll Make Love to You.\"","Oh my goodness yes.","That song was especially special to me.","I would play it when my boyfriend would come over.","Yes that is mood setting music.","I wish they still made music like that these days.","Me too but that's what you call classic music.","I completely agree.","I'll just have to enjoy the songs that they did make back then."]},
{"tag": "Hey", "patterns":[ "Who sings \"Hey Jude\"?"], "responses": ["That would be The Beatles.","Who is in that group?","John Lennon, Paul McCartney, Ringo Starr and George Harrison\nWhat year are they from?","They were biggest in the 60's and 70's.","Nice.","What is another song of theirs?","Revolution\nWho is their singer?","All of them, but John and Paul sang the most\nWhat does Ringo do?","He is the drummer\nThey sound like a good band.","They are one of the best.","What is their genre?","Rock and roll\nWho is another great rock band from the old days?","The Beach Boys\nNice.","I will listen to them too.","Good idea.","They are a great band."]},
{"tag": "Lorde", "patterns":[ "Have you heard the new Lorde album yet?"], "responses": ["I don't even know who that is.","She's a pop singer from New Zealand.","She sang that Royals song a few years ago.","I remember that song I like it.","I'll have to check out her new cd.","It's really good.","I've been listening to that and a lot of EDM lately.","What's EDM?","It's electronic dance music.","Like the kind that they play in clubs.","Cool.","Who are some of your favorite groups?","Well, I like Dillon Francis, Skrillex, and Major Lazer.","I know them!","They did that song with Justin Beiber!.","Yeah, Cold Water.","That's a pretty good song.","They play it on the radio all the time.","What have you been listening to?","A little bit of everything, but mostly old school hip hop.","Like who?","A Tribe Called Quest and Diggable Planets\nI remember that one song from the 90s.","Something about leaving a wallet somewhere.","Yeah!","It's \"I left my wallet in El Segundo.","I'm going to have to download some of their stuff.","Be sure to download the Low End Theory.","It's their best."]},
{"tag": "What", "patterns":[ "What's your favorite one","hit wonder song?"], "responses": ["Easy: Come On Eileen.","Why that one?","Well, it's fun, and you have no idea what the lyrics are.","That's true "," even with lyrics in the background I can't understand them at all.","I also like playing them.","You've performed their music?","My pep band in undergrad had that as our repertoire.","Was the tuba part boring?","I know you played tuba.","I did!","But no, it wasn't boring at all.","It's actually a fast","moving part that's pretty fun.","Have you listened to their other songs?","If I did, that would defeat the one","hit","wonder status, wouldn't it?","No, that applies to radio play.","I know, I'm kidding.","I own their first CD.","How is it?","Completely unremarkable.","Why don't you like it?","It's not that I don't like it.","It's just that there's a reason they're one","hit","wonders.","Why would that be?","All their music sounds the same.","Nothing about it distinguishes it from anything else they've produced."]},
{"tag": "Do", "patterns":[ "Do you think there's a definitive end to possible new music?"], "responses": ["Of course not, what do you mean?","Well, think about it "," there are essentially only 12 notes right?","Well sure, across octaves.","What's your point?","Those 12 notes can't be thrown together randomly "," there are certain specific scales that sound universally good to everyone.","Yeah, I suppose...\nWell, you have 12 notes, you have certain scales "," there's a finite number of bits to music that make it sound good.","You're saying we could hit an upper limit on song structures?","Essentially, yes.","There is an upper limit to the amount of unique songs that can be written.","Assuming you're not just putting together random notes and calling it a new composition...","Yes, this assumes that the end product follows the established musical rules.","But won't those rules change over time?","Eventually they most likely will, but our sense experiences would have to change.","what do you mean by that?","the way we hear music, how our ears react to specific tones "," that all would have to change\nfor us to break through that upper limit of innovation?","That's what I think "," for music to sound good it must follow certain rules and those rules also create a finite amount of possible new music\nUnless we see new genres that break those rules "," like harsh noise.","What if harsh noise as a protest to this became the new pop standard?","Then I suppose we'd all find the pop music of the future to be a lot worse, and a lot more interesting.","well, then may we live in interesting times..."]},
{"tag": "What", "patterns":[ "What was the name of that song you played for me the other day?"], "responses": ["\"Every Rose Has Its Thorn\" by Poison.","I still can't believe you'd never heard it.","Well, I wasn't born until 1995.","That's true.","You missed out on 80s hair band scene.","Yeah, I really loved that song though.","Do you have any other recommendations?","Slow songs or just good songs in general?","Slow songs.","I like the romantic stuff.","\"Without You\" by Motley Crue is really romantic.","I'll have to look that one up.","What else?","If you want more Poison, try \"I Won't Forget You\" or \"Life Goes On\".","Great!","Yeah, I really like that guy's voice.","Bret Michaels.","Yeah, he's awesome.","What else?","Try \"Heaven\" by Warrant.","That was always one of my favorites.","What about Bon Jovi?","Is their early stuff any good?","Of course!","Try \"I'll Be There for You\" or \"Born to Be My Baby\".","\"Living on a Prayer\" is also really awesome.","Okay, I'll write that down.","Make sure you put down Skid Row, too.","\"I Remember You\" is a gorgeous song.","I will, thanks!","You're welcome!","Let me know when you need more suggestions."]},
{"tag": "Okay", "patterns":[ "Lets talk about music\nOkay sounds good\nDo you like shania twain\nYes i love her\nMe too\nShes a great icon\nI heard shes coming out with a new album\nReally?"], "responses": ["Its been forever\nI know right\nThis is so suprising\nI know\nWhen is it suppose to come out\nSometime in the fall\nWow i cant wait now\nMe either\nI just googled it she hasnt released an album in 15 years\nThat is crazy\nI wonder why now\nI was wondering that too\nIts wierd"]},
{"tag": "Iron", "patterns":[ "Are you going to see Iron Maiden in Brooklyn in July?"], "responses": ["I really wanted to go, but in the end, I decided not to.","What?","I thought you were the ultimate Iron Maiden fan!","How can you not go?","I heard they were only playing songs off the new album.","They're not playing ANY of the old classics!","Woah, are you serious?","How can that be?","Fans want to hear the classic songs from all the old albums.","Exactly!","I want to hear songs from Powerslave, The Number of the Beast, Somewhere in Time and Seventh Son of a Seventh Son.","The new material can't compare to the great songs they played while I was growing up.","I wonder why they would do that...","I guess they only play the old songs on the tours between albums.","That's really dumb if you ask me.","They should at least play a mix of old and new songs.","I agree.","Somebody should tell that to the band!","So I noticed you only mentioned you wanted to hear albums with songs that have Bruce Dickinson on vocals.","What about the first two albums?","To be honest, I'm really not crazy about the albums with Paul Di'anno on vocals.","That's blasphemy!","Why not?","He's an inferior vocalist to Dickinson.","As was Blaze Bayley in the other albums I didn't mention.","You mean to say you don't like Di'anno's songs like Charlotte the Harlot?","Those are cult classics too!","Yes, but when you hear Dickinson do his versions of those songs in concert, the difference is tremendous.","Well I have to agree with you that Dickinson is the better vocalist, but you have to respect Paul Di'anno.","I didn't say I didn't respect him.","I just said I didn't really like his vocal performance.","Anyway, Are you sure you don't want to go to the concert?","Yes, I think I'll sit this one out and wait for a tour where they play the old songs!"]},
{"tag": "Ed", "patterns":[ "Have you heard the most recent Ed Sheeran song?"], "responses": ["I think so, but unfortunately his songs all blend together for me.","Oh, really?","He's my favorite artist.","I prefer Coldplay.","Have you seen them in concert?","No, their concerts are way too expensive.","I know.","It's hard to justify spending so much money.","Have you seen Ed Sheeran in concert?","Yes, but it was a really long time ago.","How was it?","Is he good live?","He's amazing live!","He did an acoustic set.","That's awesome.","Some people sound terrible live.","You had a bad experience at a concert?","Yes.","We saw Katy Perry live and she was so off","key.","That's so surprising.","She could barely hit any of the notes in \"Firework\" or \"Dark Horse.\"","You would think that a famous act like Katy Perry would be great live.","I guess not.","We learned our lesson.","They should have refunded all your tickets.","I wish.","I could have put that money toward a Coldplay concert."]},
{"tag": "New", "patterns":[ "How crazy is it that New Found Glory is still making music?"], "responses": ["It is not that crazy they are a good band.","But to be around this long is insane nowadays.","Funny thing is they probably dont get in the rock and roll hall of fame.","Why do you say that?","Because typically bands from this genre dont get in.","Because they arent on a major label?","No because they arent radio hits.","What is actually even played on radio anymore?","I know thats sort of my point.","So if they played semi","indie music from Britain they would be in?","Yeah sure if you look at it that way\nWhat other way is there?","They just dont have a song that the masses know.","I think they have a ton of hits\nBut thats with a specific group of people\nSo their music doesnt have mass appeal?","I wouldnt say they dont have mass appeal but its just not there with sales.","They have survived this long I think they are doing just fine.","They do have quite an exquisite tour bus from what I have seen."]},
{"tag": "Ed", "patterns":[ "What do you think of Ed Sheeran as an artist?"], "responses": ["I have no idea who that is, can you tell me?","Sure!","He is a Caucasian guy with red hair and sings different popular songs like \"Shape of You.\"","Oh I think I have heard of him actually!","Isn't he great?","I love his lyrics.","Yes I remember that song from the radio now.","It's a favorite of mine.","What's funny is I feel like his face doesn't match his voice.","I can see what you mean but I really do love his music.","I do too, I downloaded some of his songs to my phone last night.","I think I may do the same, I could use more music on my phone when I travel.","What other music are you into?","I really like Twenty One Pilots.","Oh I do too!","Actually one of my favorite songs by them was on the movie Suicide Squad.","Oh really, which song is that?","Their song \"Heathens.\"","Oh I know that one!","I like it a lot.","Me too and I love the movie as well.","I do too, it's a favorite of my hubby's.","Yes I can't wait to watch it again and listen to the song \"Heathens.\""]},
{"tag": "What", "patterns":[ "What are you listening to right now?"], "responses": ["I am playing a song by Coldplay.","I love Coldplay!","What is the name of the lead singer?","I forgot his name\nHis name is Chris Martin.","He has a phenomenal voice.","I love when he sings.","Yes, I do too.","Coldplay is one of my favorite bands.","They are from England, right?","They are!","They've been around for quite a while at this point too.","One of the first songs I heard from them was called Yellow\nI remember that song.","It is beautiful.","Their song has really evolved over the years though.","I agree.","My favorite song from them is Clocks.","The piano part on that song is phenomenal.","You are right.","That is why I like it so much.","Do you have any other favorites from them?","i recently fell in love with a song from them called Sky Full of Stars.","That song is relatively new, right?","Yes.","It is a pretty new song.","It got a lot of radio play.","I definitely heard it on the radio a few times.","I think I am going to listen to the radio soon.","I hope they play that song!"]},
{"tag": "Michael", "patterns":[ "Question for you, who do you think was more talented Michael Jackson or Prince?"], "responses": ["I'm not really sure, I've got mixed feelings on it.","They were both amazing.","I agree, but overall, I think Prince was more talented.","I can see your line of thinking, but I'm going to have to say Michael.","See, that's what I thought at first too, he definitely has more hits.","Yeah, everyone knows his songs.","But, I think overall, Prince was more talented.","Why do you say that?","Well, he tears it up on guitar, had one of the best voices in Music, and he wrote a lot of his stuff.","That's true, so I guess on talent he does have one up on Michael.","Even though he's more talented, I think I'd still rather see Michael Jackson in concert.","That would be awesome, I'm sad it'll never happen.","I think there's only one other band I would rather see then him.","More than Michael?","Who?","Queen.","I don't know how I didn't think about them!","Good call.","Freddie Mercury had the best voice in Rock, and seeing videos they put on an amazing show.","Yeah they did, what's your favorite queen song?","Probably Bohemian Rhapsody.","Mine too.","We will rock you is a classic too.","Can't argue with you on that."]},
{"tag": "Taylor", "patterns":[ "What do you think about Taylor Swift?"], "responses": ["I don't know I haven't listened to a lot of her music because I use Spotify.","She actually just made her music available on Spotify!","Oh really!","I will have to listen.","In my opinion, 22 is her best album.","I know a few of the songs on Red.","I love that one too!","All Too Well is my favorite song.","What other artists do you like?","I really like a few of Skylar Grays songs.","Who is she?","She is a singer/songwriter from Wisconsin.","She sounds familiar.","What are some of her main songs?","She sings Cannonball and Invisible.","Oh actually I do know Cannonball, that has the X Ambassadors in it right?","Yes that's the one!","I went to their concert last year they are so talented.","I first heard out about them when I heard Renegades on the radio.","Yes I love that song!","I also really like Unsteady.","I enjoy their rock sound and that they a typical \"pop\" band.","Yeah they are a bit more alternative.","Similar to a new band I just found called Arizona."]},
{"tag": "Michael", "patterns":[ "I was really sad when George Michael passed away."], "responses": ["Yeah, me too.","We've lost too many legends over the past few years.","Like Michael Jackson.","That was a hard one.","Honestly, I never really liked him much.","I really miss Whitney Houston, though.","Yeah, she had a beautiful voice.","I really like that song she did for The Bodyguard Soundtrack.","\"I Will Always Love You\"?","Yes.","It's sad, but it's really romantic, you know?","I agree.","Gaps some of her earlier stuff was really good, too.","Like \"The Greatest Love of All\"?","I was in elementary school when that song came out.","We used to sing it in chorus.","I bet that was fun.","What other songs of hers do you like?","I really love the upbeat songs as well.","Like \"I Wanna to Dance with Somebody\"?","Oh yeah!","I haven't heard that one in ages.","\"So Emotional\" is another good one.","Really?","I don't think I've ever heard it.","I'm pretty sure it was on that same album.","Oh, I never got the albums.","Just heard what was played on the radio.","You should check it out sometime.","I'll send you a link to the YouTube video if you want.","That would be great!"]},
{"tag": "Do", "patterns":[ "Do you ever go back and listen to really nostalgic music from your past?"], "responses": ["I love doing that.","I was just listening to Taking Back Sunday's first CD the other day.","I used to play that CD constantly.","I had completely forgotten about it until I saw it in my old memory box.","I used to listen to them and Brand New on repeat for hours.","Brand New was amazing too.","Remember Saosin?","I actually saw them live once.","Their vocalist made a new band called Circa Survive afterwards.","Yeah, and Saosin replaced him with another guy.","Who did you see them live with?","It was at the Van's Warped tour, so there was a lot of bands.","Yeah, the flyer for those events are always filled with bands.","That type of music isn't as popular as it used to be, though.","That's very true.","Everything is going electronic now.","I think it's a good and a bad thing.","Me too.","New music sounds great but sometimes you miss having real instruments.","Yeah the quality of recordings is crazy now.","Although some people are deciding to stick with the more vintage stuff, I've noticed."]},
{"tag": "Who", "patterns":[ "Who's the greatest frontman of all time?"], "responses": ["By that you mean lead vocalist?","Yes, who's the greatest lead vocalist of all time.","Easy.","Freddy Mercury.","I can't really argue too much with that.","Queen is an all time great band, and Freddy Mercury was the heart of Queen.","It's all about that magnetism on stage.","You couldn't keep from focusing on him at all times.","Speaking of magnetism "," What about Prince?","Does Prince even count as a frontman?","Well, he was the lead singer in all his songs.","I guess I just think of a frontman more in the context of vocalist, lead guitar, rythym guitar, bass guitar, drums.","Prince's music is a little more outside the box.","That's true, but I still think he could count as a frontman.","Prince was pretty electric himself.","But I'd still take Freddy Mercury.","How about Keith Morrison?","The Doors were a little bit before my time.","Plus, how much of that was lifestyle and hype versus actual musicianship.","For a frontman, the lifestyle and hype can be just as important as the music.","I don't agree.","The bottom line is always the music.","I just think that Rock n Roll as a concept goes beyond music.","It's a lifestyle, a spirit or attitude.","For sure, it is.","But the music is the foundation.","I can't disagree.","And Freddie Mercury's music was wonderful.","Yeah, it's sad he's not with with us anymore."]},
{"tag": "What", "patterns":[ "What are you feeling on lana del rey?"], "responses": ["I actually love her.","I think she is sexy and cool.","Ya she is pretty sultry and ultra cool.","I love her videogames song.","That is a good one along with bluejeans and summertime sadness.","She has such a nice tone and quality to her voice, I wish I could sing like her.","Ya I heard her live and she sounds just as good as on a recording.","Not all singers are capable of live performances that match or even come close.","Agreed.","Lady GAGA is someone similar in that she is truly a talent.","She really has the vocal chops.","Also so creative.","I am always impressed with her.","Me too.","though she does have a huge team behind her helping her create a lot of her iconic looks.","Maybe true but she is the only writing most of her songs.","Always more impressive when the singer is also the songwriter.","Does Adele write her own songs?","I would think at least some of them.","They seem so personal to her.","I know sia first wrote songs for other artists before making her own album.","I love sia, she is such a talent.","And like that she hides her face.","I wonder if it is because her music has a younger sound/appeal.","Yet she is pretty old.","I didn't know she was old at all!","Maybe that is part of it, smart on her part.","Makes me like her even more now.","Well glad I could strengthen your love for Sia, she deserves it!","I am going to go look up her age.","Thanks for the information and chat."]},
{"tag": "What", "patterns":[ "What have you been listening to lately?"], "responses": ["I've been listening to a lot of older stuff.","I'm not crazy about any new music at the moment.","Oh really?","Ya, I've been listening to a lot of music from the 80s.","I love 80s music.","I can't get enough of Madonna, Michael Jackson and all of the other big names!","You missed a big one.","What about Prince?","That's who I've been listening to the most.","Yes, I love Prince's music!","My favorite songs have to be 1999 and Little Red Corvette.","Those are two of my favorites too.","My all time favorite is When Doves Cry though.","That's my favorite too!","When Doves Cry is from his movie Purple Rain right?","Have you ever seen it?","Yes of course!","Oh, and his song Let's Go Crazy is from Purple Rain too!","That was in the mid 1980s, that was such a great time!","I know, and Michael Jackson was also on the music scene releasing so many amazing songs.","His album Bad was my favorite.","I still have to dance when I hear the song Bad.","Yes, or The Way you Make me Feel.","There were so many number one songs on that album.","I think it had five number ones actually if I remember correctly.","Sounds about right!"]},
{"tag": "What", "patterns":[ "What type of music do you like?"], "responses": ["I don't have a certain genre that I like; but anything that gives me a good feeling is my style that I prefer.","I agree.","I don't care for rap music or heavy metal.","Me neither.","Heavy Metal seems to be just a bunch of screaming!","Are there certain songs that make you feel happy?","I liked the song Blurred Lines by Robin Thicke.","Then I really fell in love with it when Jimmy Fallon did the video.","Oh yeah, that was really good, it cracked me up!","He's done other music videos with a bunch of other people, since then, where they are using the classroom instruments.","Oh really?","I haven't heard any of the other songs that he's done.","He did \"All I want for Christmas is You\" with Mariah Carey and one by Adele, and others.","Cool!","I'll have to check out the one with Adele.","Jimmy Fallon is really a pretty good singer, even when he's acting goofy!","Do you listen to country music much?","I do.","I love Keith Urban.","I really enjoyed the video he made in his car, with his wife Nicole.","Oh, that was neat!","Where they are singing \"The Fighter\".","I think Keith and Nicole should record songs together, they'd be good.","Yeah, I'm not sure how good of a singer she is, or if she was just lip","syncing to that song.","The thing about country music, especially, is that the words in some songs could be meant to be about your real relationships, or even meant to be about your relationship with God.","I've never thought of it that way before, but yeah, that makes sense.","Yeah, the words don't directly relate to spiritual or religious meanings, but you could interpret them that way.","I'm going to start paying closer attention when I listen to country music, to pick up on what you are talking about.","Neat!"]},
{"tag": "Mumford", "patterns":[ "Do you like Mumford and Sons?"], "responses": ["Yes, I love them!","What is your favorite song of theirs?","I really like The Cave, but I like most of their songs!","I have seen them twice in Kansas City.","I wish they were opening for U2 here.","Beck is opening here.","I would rather see Mumford than Beck.","He's ok, but not my favorite.","I only really know one song by him, Loeer,\nHe has some other good songs.","What other bands do you like?","I like the Strumbrellas, the Chainsmokers, and the Lumineers.","So you like alternative country the best?","I like the Avett Brothers.","I wanted to go to Nashville to a festival where they were playing but I couldn't get tickets.","That would.have been cool, I like that song I and Love and You.","Weren't they on Colbert once?","Yes, I think so, but I missed it,.","I should look it up on YouTube.","Are you going to any concerts this summer?","No, I don't have the money.","I would like to see the Avett Brothers if they come nearby again.","Maybe we could go together?","We should go to Knuckleheads to see Trampled Under Foot.","I have never heard of them.","They are a blues group from here in KC.","They are siblings,and the lead singer has an amazing voice.","Sounds like fun.","When are they playing and how much are tickets?"]},
{"tag": "Yngwie", "patterns":[ "Did any of Yngwie Malmsteen's singers come back after they were fired?"], "responses": ["Yes!","The first time I saw Yngwie live was back in 1999, and Mark Boals was back in the fold!","Where was that show?","It was at the I","Rock Nightclub in Detroit.","I've heard of that place.","How was the show though?","Mark Boals was in very fine form!","His voice was amazing and he sang amazingly.","What about Yngwie?","I heard he goes through bad periods sometimes with his live playing.","He was off in some ways, he seemed to pick the notes randomly.","I've seen him play really good and melodiously also though.","When was that?","At the Royal Oak Music Theater one time.","He was playing with three fingers instead of four.","I've heard about that, what's up with that?","I think he overuses his pinky by using it to play the forth and fifth notes.","That involves stretching the pinky and using it twice as much as the other fingers.","Hmm.","The smallest finger and you're using it twice as much, sounds unhealthy.","Yes, that's what I think it is.","Just jog your hand a little and use your index finger and your pinky instead of overusing your pinky!","So, any other good songs you've listened to lately?","Yes, I was listening to Leonardo the other day.","It's from an album that came out in 2000 and it features Mark Boals on vocals.","Wow, so that's a good one?","Yes, I like it a lot; it's about Leonardo Da Vinci.","Amazing!","I think I'll listen to that on Youtube when I get home.","Great idea, that's where I was listening to it!"]},
{"tag": "Taylor", "patterns":[ "Hey, did you hear Taylor Swift's music  is back on Spotify?"], "responses": ["No, I haven't.","When did that happen?","Just in the past week or two I think.","Oh, interesting.","What do you think about her track \"Blank Space\"?","I really like the song, but some people prefer her old music.","I personally agree with you, country music is fine but I prefer her new style.","What do you think of Katy Perry?","I'm not a big fan.","I prefer bands, such as Cold War Kids.","I've never heard of them, what genre are they?","I would say the are Indie/Alternative.","Similar to The Young Giants?","Yes, I would say so to an to an extent.","When did they last release an album?","Their most recent album was L.A. Divine.","What's your favorite song by them?","I really like Hang Me Up to Dry.","I think First is really popular too.","I might've heard First before, actually.","Yeah it was really popular when it came out.","Have you seen them in concert?","Not yet, but I would like to.","They opened for Modest Mouse before.","Wow!","I love Modest Mouse."]},
{"tag": "What", "patterns":[ "What type of music to you like best?"], "responses": ["I find myself going for oldies a lot and pop.","That's cool , any recommendations or stand out favorites?","Well I always say the beatles, I thought everyone knew there music but I was the introduction for one guy so now I tell everyone who asks.","I actually love them like the masses, crazy to think some people don't know their music.","I think it is perhaps mostly the younger generation.","Makes sense.","What is your favorite beatles song?","I really love across the universe.","The lyrics are so poetic and the flow of them creates these images of peace , like a feather floating.","Wow that is a pretty deep response.","my favorite is here comes the sun.","That was my cousin wedding isle song, she is blonde and very cheery and fit her so well.","It had me tearing up.","I find I get very emotional hearing a lot of the beatles music.","Eleanor rigby gets to me, maybe it is the image of a lonely person/people.","They just have countless hits.","I adore strawberry fields forever, and hey jude.","Apparently hey jude was written for john lennon's son during his parents divorce.","I think I had heard that .","which beatle wrote that one?","It was paul.","He and lennon are my favorite.","I think each beatles had his charm but see those two as the most popular.","Ya for sure , I mean look at Imagine..  one of the greatest songs ever and that was Lennon.","Was that from a solo album or still with the beatles?","I am really not sure.","It could be from his solo career.I know he alone wrote it.","Either way such an impactful song and he is not doubt a legend among the beatles and world."]},
{"tag": "Do", "patterns":[ "Do you have a favorite classical music composer?"], "responses": ["I've never really thought that much about it.","Well, are there any classical compositions that you especially like?","Hmmm...","I like Beethoven's Fifth Symphony.","And Fur Elise.","Those are both great songs.","So maybe Beethoven is my favorite?","Not a bad pick.","I am more partial to Bach.","He's the one that wrote Toccata and Fugue?","Yes, that was Bach.","I guess that was a pretty good song too.","What I like about Bach was how mathematical his music is.","What do you mean by that?","He wrote music in a way that had mathematical precision in the foundation.","His songs were structured almost like equations.","Whoa!","That's not a concept I've ever heard of.","Yes, it's very interesting.","Most people think about music as free","form expression, but Bach's compositions were anything but.","I don't appreciate music on that deep a level.","I just like a good tune.","I think Bach's songs work on that surface level too.","Like you said, Toccata and Fugue is pleasant to listen to without knowing the deep stuff.","True.","I'll still stick with Beethoven, though.","Nothing wrong with that.","Both guys would be on the Mt.","Rushmore of classical music.","Along with Mozart!"]},
{"tag": "Do", "patterns":[ "Do you ever teach music theory with musicals?"], "responses": ["Of course!","We have to keep it relevant to the students.","They don't all care about Montiverdi.","Which are your favorites to use?","It's hard because there's so much offensive stuff that can get me in trouble.","So, which?","The Music Man, West Side Story, and The Book of Mormon.","The Book of Mormon, seriously?","Yup, of course!","How'd you get away with that?","It's super offensive!","They love it, actually, and I'm able to find plenty of excerpts that are innocent.","Like what?","\"Turn it off\" is a great example, I just cut it short before the crap about spousal abuse.","Yeah, that's rough.","What's that song a good example of?","It's a perfect example of a viio7/ii.","Seriously?","Yup, all the voice","leading is correct with proper resolutions!","Can you hear everything, or is it kind of in the background?","With the instrumentation, it's pretty obvious.","Nice!","I'll have to look into it."]},
{"tag": "Taylor", "patterns":[ "Who do you like better: Taylor Swift or Katy Perry?"], "responses": ["I prefer Taylor, though honestly, I'm not a huge fan of either.","Really?","Who do you like?","I'm really into Miley Cyrus.","I didn't know that!","What do you think of her latest single?","\"Malibu\"?","Yeah, I haven't heard it yet, but it's supposed to be really good.","It is!","I've been playing it on repeat for over a week!","Is it that club type music she was doing for a while?","No, it's more of a country inspired pop song.","She's really getting back to her roots.","Oh, that's nice.","Yeah, I really feel like she's found herself over the past three years, both as an artist and a person.","Why do you say that?","I don't know how to explain it, but she just seems more like herself these days.","Is she putting out an album to go with the single?","I'm not sure, but I hope so!","I can't wait to hear more from her.","Yeah, I've been meaning to check out the single, just haven't had a chance.","I can send you the YouTube link if you want.","That would be great!","I think you'll really like it."]},
{"tag": "Yes", "patterns":[ "Do you like music\nYes love music\nOkay lets talk about that then\nSounds great\nWhat do you like?"], "responses": ["I like rock\nOh okay like who?","I mainly listen to metalica and led zeppelin\nIve heard them a little\nHo do you listen to?","I listen to pop music\nWho do you like?","Meghann trainor, lady gaga\nI havent heard too much of them\nI like them\nI only listen to rock, i also like some slipkmot\nIve never hesrd a slipknot song\nThey are good, you should check them out\nI will\nAwesome"]},
{"tag": "Alex", "patterns":[ "Have you heard of Alex G?"], "responses": ["I haven't.","Is he any good?","I love his music.","What kind of genre is he?","He's hard to describe.","He's lo","fi, but he plays a lot of genres.","What kind?","His last record featured lo","fi to even nu","metal type elements.","Dang.","What's the album called?","\"Rocket\".","It just came out a few weeks ago.","I'll have to check it out.","Is it on Spotify?","It is actually.","I listen to it everyday there.","I'll add it to my daily mix then.","He has several albums on there as well.","I have some catching up to do then.","Yeah, all of them are great listens.","Any album I should start with?","Honestly, they're all good starts.","I'll just start with his last album then.","Tell me what you think of it!","Will do!"]},
{"tag": "What", "patterns":[ "What is your favorite kind of music?"], "responses": ["I love lots of different music but some of my favorite is Gospel.","I enjoy some Gospel too, who is your favorite artist?","I have several but one of them is Kirk Franklin, do you know who that is?","Yes he sings that song \"Lean On Me.\"","Right!","It's not a new song but it's a great one.","I like to listen to Gospel when I get ready for church on the weekends.","He has a wonderful voice and I enjoy his lyrics.","I completely agree with you there.","Do you remember who Fred Hammond is?","I think so, can you name one of his songs?","One of the best in my opinion is \"Glory to Glory.\"","I remember that!","It gets me excited as I'm getting ready in the morning.","It does me too!","It's a great song.","I really enjoy Gospel music, it's a large majority of what I listen to.","I think I may try some new artists in Gospel.","That couldn't hurt.","Another good artist is Pamela Mann.","Doesn't she play on some Tyler Perry show also?","Yes she does!","I thought her name sounded familiar."]},
{"tag": "Taylor", "patterns":[ "What do you think of Taylor swift\nI like her."], "responses": ["She is a phenomenal singer\nWhat do you think about her changing music genres\nI think she should've stayed with county music\nWhich pop star do you think made the 90s\nI personally liked Cheryl crow\nWhat do you think of eminem\nEminem has a bunch of great hits\nHe can get a bit raunchy don't you think\nYes I believe he can\nDo you think kid rock is played out\nYes I kind of do.","He really only had a couple of huge hits\nDo you know what song made Britney spears a hit\nYeah it was hit me baby one more time\nWhich music genre do you think is the best\nMe personally I like rock music\nWhat music do you think shouldnt be\nI think that all music is great\nHow many boy bands are there\nThere certainly are all of boy bands"]},
{"tag": "Hop", "patterns":[ "I've decided to give Hip","Hop music a try."], "responses": ["Good choice!","It's a great genre.","Yeah, I know a lot of people like it, but I've never really given it a shot.","As you know, I'm big into Hip Hop.","That's why I came to talk with you.","Can you recommend something for me?","Absolutely.","So you've never listened to any Hip Hop music in the past?","I've seen a few Snoop Dogg videos, maybe heard some Tupac.","Maybe a Jay","Z song or something.","But nothing really stuck with you?","That's right.","I couldn't tell you the name of any of the songs.","OK, I'd actually tell you to go in another direction.","What do you mean?","Well, all those artists you mentioned are very commercial, mainstream artists.","Yeah, if I know their names, they must be!","But that's only one small part of hip hop music.","I think you'd connect with more conscious, activist Hip Hop music.","I could see that.","I was turned off by the materialism exhibited by guys like Jay Z and Snoop Dogg.","Try the album Blackstar.","It's by a couple of MCs named Talib Kweli and Mos Def.","Mos Def the actor?","He was an MC way before he was an actor.","Music is what made him famous.","I liked him in Hitchhiker's Guide to the Galaxy.","I'll try the album.","Start off with the song 'Re:Definition'.","You won't be sorry!"]},
{"tag": "Houston", "patterns":[ "Whitney Houston classics, of them which are your favorites?"], "responses": ["Whitney had so many , I think One Moment in Time, I want to Run to You, and Im Every Woman\nShe was excellent, there are few like her today.","Bruno Mars is coming to town soon.","Really, I didn't know that.","Yeah, his concert tour starts this next week in Houston.","I have some concerts booked for the summer too.","Which concerts are you going to check out?","Sting will be coming, so I have booked his concert.","What songs do you like of Sting?","Fields of Gold, and Set Them Free are some of my favorites!","Oh yes, I saw him in concert with Annie Lennox one time.","Really?","Yeah, Annie opened for him , and she played on stage with him at some point for that concert.","That one was phenomenal I bet.","So action packed.","Yes, they were phenomenal.","I hope Annie tours again in my area soon.","She may come but you might have to travel to see her.","Ok, sounds good!","I can't wait.","She is one of the best singers."]},
{"tag": "Beyonce", "patterns":[ "Do you like Beyonce?"], "responses": ["Not really.","I am not a big fan of Beyonce.","Are you kidding?","I thought everybody liked Beyonce.","Many people do, but I am not a fan.","Why not?","I don't like her voice very much.","I can't believe that.","I love her voice!","It is incredible.","I know she has a great range, but I just do not like the tone.","Have you heard her album Lemonade?","I have not.","What is it about?","It is about a lot of things.","Parts of it are very serious and about race relations.","Interesting.","I did not know she had music about that topic.","She does!","It is very important to her.","Maybe I will give her another chance.","I love music about that topic.","That album even won some Grammy awards.","That is amazing.","I didn't know much about that record at all.","It sold a large amount of copies and was rated as one of the best releases of the year.","I will definitely check it out then and give it a listen.","It is one of my favorite albums of the last few years.","Thank you for sharing all of this info about Beyonce.","You might have changed my mind about her."]},
{"tag": "Hey", "patterns":[ "Hey, what do you think of electronic dance music?"], "responses": ["I really like it, but I dont like how closely it is held with drug use.","Yeah, most people who listen to it regularly know that it is all about the music and not about the drug use.","Thats good to hear.","It realy gets my blood pumping with the constant bass that it has.","Yes, bass is the focal point and I love bass.","The progression of the songs really gets me too.","What do you mean.","Well, how it starts soft and builds.","Then drops and goes craz, right?","Right!","Its not a constant high all of the time.","Well, some genres of electronic dance music are.","Lke what?","Like hardstyle to me is pretty hard core all of the time.","Yeah I guess so,\nTrance is also pretty mellow most of the time.","Does it bother you that the music mostly doesnt have words?","Not really.","I never listen to words anyways\nSame here.","I feel like most people just like the flow and how the music makes them feel."]},
{"tag": "Who", "patterns":[ "Who do you think is a stronger singer adlle or beyonce?"], "responses": ["Oh that is tough.. Beyonce for me.","I go Adele.","Why , beyonce has many more hits and is so much fiercer.","I will give to beyonce when it comes to presentation, Lately her performances at video awards are like moving art.","But vocally I think vocally adele has her beat.","Maybe but I think adele must have some bad technique why else did she develop nodes?","I don't think it is only caused by poor vocal technique.","Julia andrews also had them and she is a pro.","I suppose I don't know enough on the subject.","I just thought the two went hand and hand.","Okay who is the better singer between arianna grande and mariah carey?","Mariah carey of course!","Okay this one I agree.But arianna  comes close to carey.","They both possess crazy vocal ranges that are almost unheard of.","Very true , not many singers have the range those two do.","So sad about arianna's london concert.","I know how tragic.","I was thinking how awful and guilt ridden I would feel if I were her.","Why?","She did nothing wrong at all.","But I would feel badly because they were there for me.","Well she should not blame herself.","I think she is being very generous.","I think she paid for the funeral costs for those who passed.","Ya I heard that.","Also the benefit concert was thoughtful.","yes, it brought a lot of great musicians together for a good cause, just too bad it had to take place at all."]},
{"tag": "Nirvana", "patterns":[ "Have you ever heard of the band Nirvana."], "responses": ["No I haven't what are they like.","It's a grunge band from the 90s.","I really like their music.","What are they famous for, what's the name of the song.","It's called smells like teen Spirit.","It's really loud, disfunctional music.","I think you would like it.","What other hits do they have so I can look them up.","You could look up heart shaped box.","Are they still around or do they have any new hits?","No the lead singer Kurt Cobain died.","The drummer went on to create his own band.","What's the drummer's band name.","The Foo Fighters.","They have some good music too.","Is it all 90s music?","The same genre?","Yeah pretty much.","The Foo Fighters are a little more calm than Nirvana.","What other bands are like them?","You could look up Blind Melon.","Kurt Cobains wife's band was Hole.","Wow, his wife was in a band too?","Yeah it's interesting.","There are a lot of documentaries you can look up on Kurt Cobain.","I'll look into a documentary.","His music sounds interesting.","Let me know if you want more band names for grunge rock.","I totally will!","Thanks for your suggestions!"]},
{"tag": "Do", "patterns":[ "Do you want to go to a concert with me?"], "responses": ["Sure, who are you going to see?","I was thinking of going to see Nine Inch Nails.","Aren't they like Marilyn Manson?","Scary metal stuff?","No, they're industrial and they have a lot of songs that play on the radio.","Oh really.","What ones?","Came Back Haunted, Hand That Feeds, Hurt.","Isn't Hurt a cover of Johnny Cash?","Actually, no.","Trent Reznor wrote it and it's on the 1994 album, The Downward Spiral.","So Johnny Cash covered Nine Inch Nails?","Yes, shortly before he passed away too.","It was appropriate.","That's sad.","I really like that song.","Yeah, you'd like a lot of more Nine Inch Nails too.","Trent Reznor does soundtracks for movies too.","Oh really?","What ones?","Gone Girl, for one.","It sounds very Nine Inch Nails ish.","I had no idea.","Yep.","So would you go to the concert with me?","Sure, when is it?","September 10th, at the arena.","Prepare to be amazed.","Oh, I am.","It sounds like fun!"]},
{"tag": "Jar", "patterns":[ "Hey, I have the song Jar of Hearts stuck in my head!"], "responses": ["Who sings that?","Christina Perri.","Have you heard her sing?","It doesn't sound familiar.","Her voice is great.","It is has a great range but it is more on the raspy side.","I will have to look her up.","Her voice sounds beautiful with just a guitar.","I love when artists can sing with minimal or no instruments.","I think she also sang on of the songs from the Twilight movie.","Oh yeah, I know who you are talking about.","My daughter loves to sing along with her.","That's cute.","You all could do a duet!","We sing Jar of Hearts so loud when it comes on!","I'm sure the neighbors love that.","I would love to see her in concert.","Does she have any tours coming up?","Not sure.","I don't think she has done anything new lately.","Maybe she is touring with someone.","I would still like to hear her perform live.","True, a lot of artists sound different live."]},
{"tag": "Lady", "patterns":[ "What's your favorite Lady Gaga song?"], "responses": ["There are so many!","I love all her music.","Mine is \"The Cure,\" her new release.","I've listened to that a bunch of times on YouTube.","What do you think?","It sounds like she's trying to sing like Adele in it at times, honestly.","I don't really hear it, sorry.","But I love the unique sounds that are in it.","I know what you're talking about it.","They're kind of whistle","y.","So what's your favorite?","After all these years, Bad Romance is still my favorite.","Why is that?","Not only is it a great song, but there's tons of emotional issues for me with it.","Like what?","Remember the girl I was in love with back in Cincinnati?","Yup.","We listened to that all the time in the car, and we drove a lot.","Aww, that's sweet.","It's sad really.","How so?","I loved her, and this song reminds me of her deeply every time, which depresses me.","But I love the song and it plays all the time so I can't avoid it."]},
{"tag": "Manchester", "patterns":[ "Do you know the band Manchester Orchestra?"], "responses": ["I think so!","They are from the East Coast, right?","Correct.","They are from Atlanta.","I thought that was the case.","I heard of them years ago.","My favorite song from them is called \"Shake It Out\"\nInteresting.","I am more partial to the song \"I Can Feel A Hot One\"\nWhat year was that song released?","It came out in 2009\nWho is the main songwriter of the band?","I believe that his name is Andy Hull.","That sounds familiar.","I remember reading his name on the liner notes of the band's CD.","There are more members in the band than just him though.","Who else is in the band?","The drummer is named Tim Very.","Good to know.","Who plays guitar?","Robert McDowell is the name of the lead guitarist.","And Andy Hull also plays rhythm guitar, right?","Correct.","He plays and he sings.","Wow, I am always impressed when people can do that.","Me too!","I wish I had that skill set."]},
{"tag": "music", "patterns":[ "I need some new music."], "responses": ["I have some good music for you!","Really?","What have you been listening to?","I've been obsessed with Spanish music recently.","Like who?","I don't listen to a lot of Spanish music.","I like J Quiles, Don Omar, and Maluma.","Who are they?","What kind of music?","It's like pop.","You probably won't understand what they're saying but you'll like the music.","Really?","Who's your favorite one right now?","I love maluma.","He has some great songs.","Which ones should I listen to?","Try Sin contrato and el perdedor first.","Okay, ill listen to those.","I'm telling you you'll like them.","Plus he's so cute.","That never hurts!","I know but the music is also really catchy.","I listen to it on my way to work or while working out.","It's good for working out?","Yes it's really upbeat and catchy.","Okay Ill let you know what I think after I hear the songs!","Let me know if you like them.","I've got a bunch to recommend to you!"]},
{"tag": "Keith", "patterns":[ "Did you see the collaboration with Keith Urban and Carrie Underwood?"], "responses": ["Was it a duet?","Yes, their duet is called \"The Fighter\".","Are duets becoming popular in country music?","Yes, Luke Bryan and Jason Derulo collaborated on a song.","Is this considered a crossover into a different genre of music?","Some artists could possibly crossover.","Does the music have a different tune?","Yes, when two artists from a different genre collaborate, the music could sound like pop country.","What is your favorite country duet?","My favorite duet is with Miranda Lambert and Keith Urban.","Are there any artists that you think could make a great duet?","I think Kelsea Ballerini and Luke Bryan?","What artists could win an award if they made a duet?","I think Maren Morris and Chris Stapleton could win.","Why would you choose these artists?","They deliver lyrics with such passion and conviction.","This sounds like two great artists.","What artists would you choose?","I would choose country artist Thomas Rhett and pop artist Kelly Clarkson."]},
{"tag": "Makes", "patterns":[ "Makes you wonder why marching bands were so popular."], "responses": ["it began in war times.","when infantry men had to actually march towards their enemies.","yep.","I know.","Without the drumbeat, people tire and slow down.","And by keeping them in time with drum beats you get to the war zone more quickly.","That became what?","Well, it combined with the various musical elements of the day.","In the ancient world, it combined with the traveling musicians who performed at various festivals.","which at later time became an elements of the military.","For the reasons we talked about.","Right.","But as far as marching bands playing in sporting events like football, we do know the first band ever to play at a half time.","Which is...","The marching Illini.","The band from University of Illinois at Urbana champagne.","That was in 1907.","The beginning of a great American tradition.","Huh, interesting.","So before that year the half time show didn't exist?","Not as we thought of today.","Certainly not with the marching bands.","in the NFL half tiem shows come much later in 1920s i believe.","John Philip Souza thought the marching Illinis were \"the world's greatest band\"\nYep.","And coming from the March King, that was a great compliment.","It's kinda sad that these kids get made fun of util they get to college.","I mean band geeks in high school are the worst\nit's pretty harsh on many of them, but by high school, most of them get over it.","i think it's harder in jr high and earlier.","They're so vulnerable at that age.","Yep.","And once they get to college and beyond, they're popular because they can play a musical instrument, which is something most popular kids can't do.","They were too busy being cool to learn an instrument.","That's even sadder than being a band geek\nNo argument here.","My kids are learning guitar and piano.","No marching band stuff though.","They will  bepopular even in high school, and even more so in college and after."]},
{"tag": "That", "patterns":[ "Lets talk about music\nThat sounds good to me\nDo yo u like country?"], "responses": ["Yes i love country\nMe too\nDo you listen to brad paisley?","Yes, he is really good\nI just bought his album\nWhat is it called\nLove and war\nWhen did it come out april 21st\nOh okay, i need to go get it\nIts really good\nIts been three years since he released an album\nI know\nI thought he wasnt going to make another one anytime soon\nExactly\nYou will like it\nIm going to get it\nAwesome"]},
{"tag": "You", "patterns":[ "You know what I miss?"], "responses": ["Eighties music.","For real.","The eighties were so unique and so timeless.","That was back when music was not commercialized and anybody could make it big.","You're right.","How many obscure bands or singers came out of nowhere to make it big.","Plenty.","Today you see the popular singers come up as youngsters and it's almost as if the industry forces them to become stars.","Yes, it does seem that way.","Just think of some of the obscure bands from the Eighties: Dexies Midnight Runners, Social Timex, A","Ha.","All one hit wonders there, but timeless music.","Who could ever forget the A","Ha song, take on me.","I still remember the video.","It's a song that's transcended generations.","I still listen to it today.","I think most of the youngsters these days recognize that song today.","I wonder if that song would be a HIT today if it was released today.","It would be if someone remade it.","But, I think you're asking if the song never existed and came out today.","Correct.","That's what I meant.","Hard to tell.","I would say yes.","Come on Eileen probably wouldn't be a HIT if it came out today.","That song is redundant and would get lost today in the endless availability of music.","I would agree.","It probably wouldn't be a HIT today.","It screams eighties.","They struck it lucky releasing it in 1982.","Sure did.","I think lots of bands did back then."]},
{"tag": "What", "patterns":[ "What happened to music?"], "responses": ["What at you talking about?","Song use to be about things.","They still are about things.","No, most songs now are about how much money and 'swag' a person has.","I guess that's true.","I miss songs that tell a story.","Like what?","Tracey Chapman's song fast car told a great story.","Isn't it about a guy having a really fast car?","No the song is about how she is escaping an abusive father but lives with an abusive boyfriend.","Why do you think it's about that.","It's what the lyrics are all about.","I guess I will have to listen to it again.","Maybe that the the problem.","People like you not paying attention.","I've heard the song but I really like the hook.","That's what all songs have become a bunch of non sense then catch hook.","So your saying Miley Cyrus songs aren't deep?","They are about as deep as a saucer.","I guess that is true too."]},
{"tag": "Have", "patterns":[ "Have you heard any good music lately?"], "responses": ["Yeah, actually I just got spotify, so I've been listening to a lot of new stuff.","Cool, I've been thinking about getting it, so what have you been listening to?","I can't stop listening to the new Kendrick Lamar album.","I've only heard one song, I think it was called Humble, is the rest of the CD good?","Yeah man!","Humble is probably my favorite but DNA is a close second.","I'm definitely going to have to listen to it.","Yeah you are, I think spotify has a free trial if you want to check it out.","Maybe I will, I think I'm just going to check it out on Youtube after we're done talking though.","Alright, but back to Kendrick, I can't stop listening to the album!","Do you think it's as good as his last album?","Well, that one was one of my favorite albums of all time, but this one is catching up to it.","Man, I know how much you love his last one, so now you've got me excited to listen to this one.","I highly recommend it, he has a song on there with Rihanna too that's really good.","Ah, I've never been a huge Rihanna fan, but I guess I'll give it a shot.","It's not one of the best songs ever, but it's still good.","Anyone else collaborate on it with him?","Well, he did a song with U2, but I'm not a huge fan of it.","You just have to listen to the whole album.","Ok, you've convinced me, I'm gonna go check it out.","Thanks man!","No problem, let me know what you think!"]},
{"tag": "Cloakroom", "patterns":[ "Have you heard of Cloakroom?"], "responses": ["I haven't.","What music do they play?","They sound like atmospheric sludge.","Woah.","Sounds interesting.","They're awesome.","They have a new album coming out in August.","Is it online yet?","Yeah, they just released a music video for it on YouTube.","I'll have to go check it out.","How many albums do they have?","Two so far.","They're both on Spotify.","Awesome.","I need to listen to them.","Tell me what you think.","Do you like that sort of genre?","I don't know if I've heard of that.","It's kind of like post rock with a touch of drone.","Is it slow?","It's actually pretty progressive.","Like prog","rock?","Sort of.","Maybe prog","rock stoner metal.","This all sounds very interesting.","It is.","Spotify has a huge selection of it.","I know what I'll be doing with the rest of my day."]},
{"tag": "Katy", "patterns":[ "Hey, have you heard that new Katy Perry Song?"], "responses": ["No, what's it called?","Swish Swish.","Is it good?","Yeah, it's her and Nikki Minaj, I like it.","I'll have to check it out, I haven't heard anything new from her lately.","It's good, it's supposedly about Taylor Swift.","Really, are they fighting?","Kind of, it's a clapback at Taylor's song.","Which one?","Bad blood.","Oh, I like that song, is Katy's as good as it?","I don't think it's as good as Taylor's song, but it's pretty good.","I'll have to listen to it, why are they even fighting?","I think it had something to do with stolen backup dancers.","Who steals backup dancers?","Well, I think Katy let her dancers go on tour with Taylor but had something in their contract where they could come back when Katy goes on tour.","And they never came back?","No, I think they did, but Taylor fired them when they asked.","Either way, you should out Katy's new song.","Alright, I will, thanks."]},
{"tag": "What", "patterns":[ "What is your secret pleasure/ guilty pleasure music or song?"], "responses": ["I am shy to admit but I love selena gomez's love you like a love song .","I don't think you should be embarrassed she is very popular.","Ya popular with teens mostly.","I think she is in the same fan base as taylor swift katy perry.","Nothing to be ashamed about,\nI suppose that is fair  to say.","Maybe I should not hide my love for her music.","Exactly, I like her gin and juice song.","Not sure of the title.","That would be, hands to myself.","Yes that is it.","Such a good song.","It is featured in her pantene commercial .","I thought that was very smart of them to use that song specifically.","It is such an adult song when you think about it.","True.","Suggestive lyrics for sure.","Crazy when you think she was one of the little kids on barney!","She was?","I did not know that about her.","Yep she got her start on that show I believe.","I wonder if that is one reason beiber loved her so much.","Funny.","Probably did watch that ,seems about the right show for his age.","I always wanted them to get back together.","Not me.","I am happy she is with the weekend.","i want them to collaborate on some music.","I think I heard some rumors that they have been in studio already working on some songs."]},
{"tag": "Pete", "patterns":[ "Hey Pete, what's you favorite band?"], "responses": ["Oh, that's easy.","Herb Alpert and the Tijuana Brass.","Who?","Herb Alpert and the Tijuana Brass.","You've heard of them?","Never.","What?","I never heard of them.","That's impossible!","They were so amazing!","Joey, I never heard of them.","I swear!","Oh, are you in for a treat!","i HAVE 72 HOURS of their greatest hits programmed in my phone!","I don't need to hear them.","You gotta hear them!","I do not gotta hear them.","Just one song.","Just one, and you will thank me!","Ok. Ok.","Listen to this... Huh?","OK\nWhat do you think?","Amazing, right?","I suddenly feel like I'm in Mexico.","Excuse me, but I have to go to the bathroom.","Yeah.","Thats a common side effect of going to Mexico...and listening to Herb Aplert and the Tijuana Brass."]},
{"tag": "So", "patterns":[ "So, what do you think of the new pretenders album?"], "responses": ["pretenders?","Who are they?","I think my parents liked them....\nReally?","You've never heard 'middle of the road' or brass in pocket?","Back on the chain gang?","Oh, okay, now I know who you're talking about.","I haven't heard anything off the new album.","Is it on the radio?","I don't think so.","I was on their website and I saw they have a new album.","There's a track called 'Holy Commotion'\nWhat do you think of it?","Is it anything like their old songs?","It seems more produced than straight instruments.","Almost like synthesized drums\nOh okay.","I don't like it when bands change styles\nMe either, but Chrissy Hynde's voice is undeniable.","She still carries the same emotion in her vocals\nSounds cool.","Maybe I'll check it out.","Can I see it on youtube?","Yes.","when I clicked on the link on the website, it took me there.","The video is set in a recording booth\nI'll check it out.","Now those old songs are coming back to me.","They sang 'Don't get me wrong'\nYes.","I love that one.","When I was on youtube, I started with the new video and ended up watching all the old ones\nI do that too.","I'll start with one thing and end up in a completely different place\nThe video for 'back on the chain gang' was from when MTV used to be a music video channel\nOh yeah,  back when Men at Work and Duran Duran were popular.","Brings back memories....\nOh yeah!","who can it be now?","and I come from a land down under!","Her name is Rio and she dances in the sand!","Now I'm starting to feel old...","Check out the video and tell me what you think!","Sure thing.","Talk to you later...."]},
{"tag": "Who", "patterns":[ "Who is your favorite band?"], "responses": ["Black Sabbath\nWho are they?","A metal band from the 70's\nWho is their singer?","Ozzy Osbourne\nCool.","Who plays the bass?","Geezer Butler\nThat is a cool name.","Are they still famous?","Yes and they inspired many other metal bands.","Was their music good?","Yes and a lot of it is scary too.","What is one of their songs?","War Pigs\nCool, and are they from America?","No, they are from overseas in Europe.","Oh, like Led Zeppelin?","Yes, I think they are from the same area.","I love Led Zeppelin.","Me too.","Stairway to Heaven rules."]},
{"tag": "Drake", "patterns":[ "Have you heard the new Drake album?"], "responses": ["No, not the whole thing.","Drake at the Billboard awards concert at Bellagio was insane.","That song was from his new album, damn!","Yeah, that song is called \"Galchyster\".","That's a weird name, not sure what that means.","I don't either, but the track is fire!","Agreed, I should take a listen to it.","The flow of his album is a bit different than his usual.","Why?","He change his style?","A little bit, it feels like reggae sort of.","That's weird, I don't know if I'll like that though.","Just have a listen to it, the album together makes sense and does sound good.","I will, especially after \"Fake Love\" and \"Galchyster\".","Are you listening to anything new?","Nah, not really, just vibing to older stuff.","Like what?","Fort Minor, some stuff from high school like Nelly, stuff like that.","Oh, I really liked them a while ago, I should listen again.","Yeah, been liking that stuff recently."]},
{"tag": "Eminem", "patterns":[ "Have you ever listened to Eminem?"], "responses": ["I have actually.","Is Eminem his real name?","No, that is his stage name.","He has a different name in real life.","What is his real name?","His name is Marshall Mathers.","Eminem is a much better name for a rapper.","I understand why he changed it.","What do you think of his music?","I love it!","His lyrics are amazing and he is very aggressive.","Do you have a favorite song?","I think I would have to say \"Love The Way You Lie\" is my favorite\nI do not like that song at all.","I'm sorry to hear that.","What is your favorite song?","My favorite is \"Rap God.\"","That song is excellent.","I'm a big fan of that one too.","I like a lot of his earlier music as well though.","What are some earlier tracks you like?","I really like \"Shake That\" & \"Just Lose It\"\nWhen are those songs from?","They were released all the way back in 2004 & 2005.","Eminem has been around for a long time.","Wow!"]},
{"tag": "Alanis", "patterns":[ "Whatever happened to Alanis Morissette?"], "responses": ["You know what, I don't know.","I was just curious because I haven't heard any new music from her recently.","Yeah, she kind of disappeared over the past 15 years.","I remember her last song from 2006, where she remade that Seal song.","Crazy?","Right?","Yes, it was Crazy.","That does seem like a long time ago.","She came on the scene and rocked it out and then mellowed out.","Yes, I wonder if the mellowing out phase started to decline her career.","Her music was still good after she mellowed out, so I'm not sure.","She was into all that spiritual stuff.","I wonder if that's why she also disappeared.","Yes, many of her songs when she mellowed out were about her trips to Asia.","The Thank You song was about India and her trip there.","Funny, how she just kind of disappeared.","Yes.","I'm going to go look her up when I get home.","Same here.","Maybe she is still making music.","Possibly.","Sometimes popular artists continue to churn out albums but we never hear any of the songs because they aren't mainstream anymore.","I bet she has made music since 2006, but we never heard any of her songs.","Possibly.","It will be interesting to see what ever happened to her."]},
{"tag": "Yes", "patterns":[ "I like talking about music\nOkay it is easiest to talk about anyway\nYes it really is\nDo you like anything specific?"], "responses": ["I like country mainly\nOh good i do too\nMy ipod is full of dierks bentley, brooks n dunn, rascall flatts\nI love all those artists\nThey are the best\nYes they are\nAnd rascall flatts God Blessed the Broken road is a classic\nYes it is\nThats still played at weddings\nI Believe that\nI also like their song, Shine On\nI love that song\nIts really good\nI havent heard it in forever\nI used to listen to it with my sister\nThats sweet"]},
{"tag": "Beatle", "patterns":[ "Who was your favorite Beatle?"], "responses": ["I'd have to say Paul.","How come Paul?","It's hard to pick but I liked his career.","Wings was a great band.","I know he played with his wife Linda.","It's cool he could play with his wife.","They had some great songs.","I liked Jet alot.","It's fun listening to that song on the radio.","He was so talented.","It's not a surprise he was successful.","I know he was successful for decades.","I liked his song Yesterday.","That was a very somber song.","It's fun to play on guitar.","I liked how much emotion his music brings.","He really gets you to think about life.","I always preferred that over technical music.","I like musicians with skill but they have to connect with me.","That's what Paul did so well."]},
{"tag": "The", "patterns":[ "Have you heard of the band 'The Toadies'?"], "responses": ["No, never heard of them.","I'm not surprised.","You'd probably have to be around my age to have heard of them.","Why is that?","They were an Alternative Rock band who was briefly popular when I was a teenager.","They didn't have a lot of staying power.","Ah, I see.","Were you a fan?","Yeah, I liked their album 'Possum Kingdom' a lot!","They seem to have an animal theme.","Toads and Possums!","Haha, they were kind of a weird band.","What do you mean by weird?","The lyrics of their songs tended to be kind of strange.","Not the typical stuff you will hear from a lot of bands.","What's an example?","Well, one of their popular songs was called 'I Come from the Water'.","And that's what it was about, how the singer or character comes from the water.","What do you mean, 'come from the water'?","It was never specified in the song.","That's what I mean, they were weird.","Yeah, that sounds weird, I agree.","But you liked them anyway.","I liked them because they were weird, not in spite of it.","Their lyrics were kind of dark and sometimes funny.","Do you think I'd enjoy them?","I'm not sure.","The sound is kind of dated, very much like grunge","y 90s music.","Hmm, I might stay away then.","It's not really my thing."]},
{"tag": "What", "patterns":[ "What musician do you think is underrated?"], "responses": ["I know he is actually very popular but harry stiles.","How is he underrated?","Well what comes to mind when you think of him?","Boy bands, hair and teen girls.","Maybe x factor.","Well that is what I mean.","He is actually a really talented songwriter.","He writes songs?","I assumed they had them given to them.","well he does not write all of one direction's music by any means but has written some.","It is also rumored he has written songs for others under an alias.","oh ya , like what?and who?","Alex & Sierra 's  I love you, also apparently written songs for  Ariana Grande and Gavin Degraw.","I did not know that at all.","More than cute face!","Much more I say.","Have you heard his song sign of the times?","Yes I know that song but did not realize it was him.","Yes he wrote that song.","It was actually inspired by a mother dying after giving birth.","Woah that is nuts, I thought it was about guns or the state of the world today.","The lyrics are so genius and universal they can be seen in many ways.My point is overall he is not given enough credit or respect he deserves.","I am beginning to agree with you.","Even with his crazy popularity there is a lot to know and admire.","It is almost a detriment to his talent that he is lumped in with the image of one direction.","But that is not that bad.. come on, super popular and successful band."]},
{"tag": "music", "patterns":[ "I really can't deal with the radio these days."], "responses": ["Why not?","It's not too bad.","It's just that so much of it is lacking strong melodies.","Well to be fair, you are a jazz fan.","You don't hear much jazz on the radio.","I like pop too!","Would you consider Andrea Bocelli pop?","Absolutely not, my friend.","He's kind of crossover though.","I guess I just resonate with strong voices like June Christy or Dean Martin.","June Christy was an absolute goddess.","Agreed.","She is so underrated.","Have you heard her Gone For the Day album?","No, I only have Something Cool and The Misty Miss Christy, both in mono.","She has so many good albums in her discography.","You're right.","I should check them all out.","And if you like June Christy, Blossom Dearie is essential.","I do have a couple of her LPs.","You know she used to perform in Paris?","I did.","Her and Josephine Baker were huge in Paris.","Josephine Baker is another one who had such an incredible voice.","There will never be another one like her.","Or another Billie Holiday or June.","They really were a cut above."]},
{"tag": "What", "patterns":[ "What is your favorite gnere of music?"], "responses": ["I really like stuff from the 60's dealing with rock & roll.","What group is your favorite from the 60's?","Would have to be the Beatles.","Did you have a favorite Beatle?","Yesm it was Paul.","Why Paul?","I thought his voice was outstanding and he could play the guitar.","What about the due groups from the 60's?","Who was your favorite?","I would say the Everly Brother's.","What was your favorite Everly Brother's song?","All I have to do is dream.","Did you have a second favorite?","Yes, would have to be Let it be me.","How about an individual artist?","Who was your favorite?","Elvis Presley\nDid you ever see him in concert?","Yes, I saw him in Hawaii in 1972.","Ticket was $15.00.","Any other artist you followed?","Yes, Neil Diamond."]},
{"tag": "David", "patterns":[ "Do you like David Bowie or Talking Heads better?"], "responses": ["Oh ",""," Bowie was great!","He really could play all sorts of music.","Do you like him better than Talking Heads?","Well, I can't really say that.","I like the way Talking Heads incorporated all sorts of world music touches into their music.","They both used Brian Eno as a producer at different times in their career.","What do you think of him?","Eno is kind of abstract.","Talking Heads and David Bowie made more accessible music, in my opinion.","So.","if you had to decide between them, which one would you pick?","I find Bowie easier to dance to.","He always manages to keep the beat going!","Then you would pick David Bowie?","Well, the Talking Heads ",""," particularly on their last three albums, where they used *zouk* style rhythms ",""," made very danceable music.","I'd agree with you there.","Their first three albums are overly cerebral: too many self","aware lyrics, and too simplistic a musical style.","Actually, I think that's why Brian Eno picked both Bowie and the Talking Heads to produce: a simple musical style.","That's a good point.","Eno liked to find a groove and build on it; it seems that a simple style would be more attractive to him.","So ",""," between David Bowie and the Talking Heads, who would you choose?","I would go with the Talking Heads: I think that both their lyrical and musical style had more development over the course of their career.","Wouldn't you agree, though, that Bowie's lyrics were more relevant to his audience throughout the years?","That's a good point: he made alienation into a virtue, and yet always retained a strong sense of irony.","Look at his last single: 'Lazarus'.","Knowing what we know now ",""," that he was that close to death ",""," it must have taken some courage to address it head on like that.","Musical courage ",""," I think that that really sums up David Bowie.","He never held back!","And that is, I think, why I would have to choose David Bowie over Talking Heads.","They were both really good, though."]},
{"tag": "Top", "patterns":[ "On the Top 10 list recently, I noticed Justin Bieber's song Let me Love You is number 1."], "responses": ["Wow, I can't believe that!","That is amazing.","DJ Snake did a video on Vevo , and it was amazing.","I saw that video, it had over 371 million views.","Do you like any of his other songs?","As long As You Love Me is great, and also Love Yourself are some great songs I love of his.","I have been to some concerts of his, and they were pretty packed with teenagers!","Oh yes, that is so funny.","I noticed that too when I went.","It's like the boy crazy deal!","The tickets were around $50 each, I think I got them on sale that weekend.","Mark My Words is also a great video and song of Justin's.","I haven't seen that one lately, but I am sure I have heard it on the radio.","Most of the time on the radio, they are the latest music from him.","U Smile comes on the radio all the time!","Baby used to come on so much that I would get sick of hearing it!","Some of the concert tickets get pretty expensive.","Yes, if you want to get really good seats, expect to pay some good money.","The tickets can get around Superbowl cost.","I believe it, they make some money, and that is not even drinks or food at the conssessions.","Oh, I know.","The venues make a killing too!","They really make money in concerts, like printing money!"]},
{"tag": "How", "patterns":[ "How old are you?"], "responses": ["43, why?","Do you remember Napster?","No, what is that?","It was a music web site that dealt with music.","Was is good?","Yes, it was.","What did that site do.","They had music to download for free.","Really?","Yes, it was illegal.","Yes, very.","Did the bands make money off of them?","I don't know.","I remember, they got sued.","Wow\nthey had rare music?","Really?","Music lovers loved that site.","I never heard of it."]},
{"tag": "Whit", "patterns":[ "Do you like Whit Zombie?"], "responses": ["I love them.","How long have you been listening to them?","Since the 90's.","I forgot the singer's name.","What is it?","Rob Zombie\nDid you like his solo stuff?","Not as much as his White Zombie stuff.","Do you have a favorite song of his?","More Human than Human\nI love that one too\nWhat is another good one?","Superbeast\nThat is a great song.","I am a big metal fan.","I love Iron Maiden too.","They are good.","Do you like AC/DC?","Yeah\nDo you like Bryan Johnson?","Yes, he is awesome.","Angus is pretty good too."]},
{"tag": "Disney", "patterns":[ "You ever think it's weird that so many Disney channel stars can sing?"], "responses": ["What, you mean like Miley Cyrus?","Wasn't that the whole point?","Well yeah, but I mean like the others that were just actors at first, like Selena Gomez.","She was the chick on Wizards, right?","Yeah, and then Demi Lovato too.","They were originally meant to be just actors, I thought.","And Hillary Duff was an actress too, right?","Yeah, and she sang.","I wonder if it was just an accident or if they did that on purpose?","I don't know, but I'm a huge fan of Demi.","Really?","Her old stuff or her new stuff?","New; I haven't really heard much of her old stuff.","She got big when I was in high school, so I listened to a lot of her songs.","Which one was your favourite?","Well, I was a big fan of Don't Forget back in the day.","Haha, a classic break up song?","Yeah, super angsty and cliche, I know.","But I liked it.","Hey, wasn't she on Camp Rock?","Dude, I totally forgot about that!","She sang in that, right?","So they must have known she could sing.","I really liked the acoustic version of her song, too.","What was it called?","\"This is Me,\" I think.","I'll pull it up now."]},
{"tag": "Hi", "patterns":[ "Hi, do you ever listen to melodic metal?"], "responses": ["I'm not sure I even know what that is, what does it sound like?","It's just like heavy metal vocals but with melodic instrumentation instead of the usual sounds\nWhat are some examples of melodic metal bands?","Killswitch Engage and Insomnium are two of my favorites\nLet me know a song I can listen to\nTry When we Sleep by Insomnium\nOk I will listen to it\nI love the way it's almost orchestrial but then you get the heavy metal screaming coming into it\nIt sounds good, I might look up some more bands in this genre\nIn Flames are another band you might like, I recently saw them live in England at a festival and was impressed\nAre they British?","No they're from Sweden, there are a lot of great metal bands coming out of those Nordic countries\nAre Insomnium Swedish too?","No, They're from Finland.","Amon Amarth are another Swedish band of the same genre, you should look them up too\nI have heard them before, they're very good, very like Sabaton\nYes, Sabaton are Swedish too.","I have heard their song Primo Victoria, it's the most memorable to me\nYes, a lot of their lyrics surround battles and wars, they are very inspiring to me\nThanks I'll look up some more melodic metal bands"]},
{"tag": "Paramore", "patterns":[ "I love the band Paramore."], "responses": ["I love that band too!","The singer has an excellent voice\nHer name is Hayley Williams.","She is so cool!","Totally!","She is always very fashionable.","Sometimes she dyes her hair interesting colors too.","She is a great and interesting front woman for the group.","Does she play instruments too?","Or does she just sing?","In the band I think she just sings.","I first heard about Paramore in 2007.","That was when the album Misery Business came out, right?","Correct!","That is still one of my favorite records.","Did you know they just released a new album?","I did not!","What is it called?","The title is After Laughter.","What does it sound like?","The album has a lot of retro vibes.","Does that mean it was inspired by an earlier decade?","If so, which one?","A lot of the songs have musical elements that were popular in the 1980s.","I love music from the 1980s!","In that case, you will probably love this record.","I'm going to go to the store to buy a copy today!"]},
{"tag": "Who", "patterns":[ "Who do you feel made the biggest impact on music?"], "responses": ["That is a question that could be answered in many ways.","Do you mean in development like way back beginning of man?","I had not meant that far, more like on modern day music.","Say elvis vs michael jackson.","Oh I see.","I would have to say michael Jackson because he really was the king of pop.","But what about elvis king of rock?","Would there have even been a king of pop without the king of rock?","This is almost like the chicken or egg question, which came first?","Except here we know elvis and the rock and roll style was born far before pop came into the world.","Fair enough, but I still feel jackson because the current music is pop mainly and so many of the artist now were directly influenced by him.","I suppose many are, I think of bruno mars and just how much he has bored or been influenced.","Ya I mean bruno mars is a great example or even beyonce.","Look at some of their costumes or dance moves even sound.","I think Bruno mars started out as an elvis impersonator funnily enough.","Well that may be true but he has much more of michael jackson's style than elvis.","I agree to some degree.","But then I wonder was michael not influenced by elvis himself?","How so , there music sounds so different.","But think of some of the dance moves, I see similarity in some leg shakes and hip gyrations.","I do know elvis was considered very scandalous at first with his hip thrusts.","Funny how times have changed.","Now we have twerking.","I don't know who wants credit for that.","certainly no either king.","Probably not.","I will stick with the moon walk thanks.","Ya  me too, maybe one or two crotch grabs for good measure."]},
{"tag": "Bob", "patterns":[ "Wow, you really like Bob Dylan, huh?"], "responses": ["Yes, he is my favorite artist ever.","What's your favorite album by him?","I think it's Blood on the Tracks.","When did that come out?","It came out in 1974; it's about his divorce with his wife Sara.","Wow, that sounds really sad!","It is, but the music is really poetic and just connects on a deeper level.","Are any of his hits on that album?","You probably know the song \"Tangled Up in Blue\" from it.","I like that song!","Is that from before or after he went electric?","He actually went electric in 1965 at the Newport Folk Festival.","It's weird that that was so controversial at the time!","I know; folk fans felt betrayed.","Pete Seeger threatened to chop the cords of his amp with an ax!","Wow, people were really emotional about music.","Definitely.","But loving Bob Dylan the way I do, I can understand it.","How long have you been a fan for?","I've liked him since I was 14, so 13 years now!","Wow, almost half your life!","I guess I was right when I said he'd always be my favorite artist!"]},
{"tag": "Do", "patterns":[ "Do you like rap music?"], "responses": ["Yes I love it.","Who's your favorite rapper?","Eminem is my personal favorite.","What's Eminem song?","I really like Rap god.","What do you like about it?","I love how fast he raps.","He does go really fast in that rap.","I think he set some record for it.","That's pretty impressive.","He has come a long way from when he first started.","He use to just rap about killing his wife didn't he?","He did have a few songs like that.","I did like that song Stan where he was rapping about that.","That's a really good song.","Did you know Eminem is almost 40 years old?","I think he's over 40.","That's pretty old for a rapper to keep going.","Just shows you how good he is."]},
{"tag": "What", "patterns":[ "What music do you want to listen to?"], "responses": ["Rock\nWhat band?","How about Metallica?","That sounds good.","Do you like them?","Yes, I love them.","I also love Black Sabbath.","You know, Metallica was inspired by Sabbath.","I think all metal bands were inspired by Sabbath.","So you like Metallica a lot?","Yeah, ever since the 90's.","What song do you want to hear?","Hero of the Day.","That's a good one.","I like their early stuff the best, but that song is really good.","So, what do you want to hear after that song?","Unforgiven\nThat is a classic\nYeah, it is one of their best.","Let's listen to Sabbath after.","Sounds great.","I love Ozzy."]},
{"tag": "Are", "patterns":[ "Are you much of a country music fan?"], "responses": ["No, I can't say I am.","I'm the same way, I just can't really get into the stuff.","Why did you bring it up.","Well, I've got a new girlfriend, and she's really into country music.","Yikes!","She might not be a keeper.","Settle down.","We get along great and she's an amazing woman, it's just the country music thing.","Have you listened to any country music since you guys started dating?","Yep, I've tried to get into it a little, or at least see what she sees in it.","And how has that gone?","Not amazingly well.","I've found a few songs that are OK, but mostly I'm not a fan.","What have you liked.","There's a song called 'My Wish' that's not bad.","Who sings it?","A group called 'Rascal Flatts'.","Never heard of them.","Yeah, me neither until recently.","Some of it is decent, but most of it just doesn't work for me.","Are you going to keep listening to country music?","I guess I sort of have to, as long as I'm with my girlfriend.","Poor guy!","Maybe you'll start to get used to it."]},
{"tag": "Who", "patterns":[ "Who do you think is the best songwriter out right now?"], "responses": ["I don't know man, maybe one of those country singers?","Really?","Like who?","Does Keith Urban right his own songs?","I'm not sure, he's pretty good though.","Who do you think is the best?","Honestly, probably Ed Sheeran?","Really?","Yeah man, all of his songs are so catchy and I'm pretty sure he writes most of them.","I'll give you that, they are catchy.","And, did you know he wrote a bunch of other famous songs?","Nah, I didn't know that, what'd he write?","I know you hate Bieber, but he wrote Love yourself, which is a smash.","Ok, the lyrics and melody are good on that one.","He wrote a bunch of one direction songs too.","What about songs I would actually like?","He wrote Old School Love by Lupe and a taylor swift song.","He really wrote the Lupe song?","That's awesome\nYeah man, he's a talented guy.","I guess he has to be with his looks."]},
{"tag": "Do", "patterns":[ "Do composers write love songs because their hearts are full, or are their hearts full because they stir themselves up with music?"], "responses": ["I don't know.","Music does go straight to the emotions.","I agree.","But maybe you'd have to be rather cold and detached to write an affecting love song?","What do you mean?","Musicians compose because their hearts are full of song.","No, they compose to fill our hearts with song.","That takes judgment, which comes from cool detachment.","So when a musician writes about his true love's light brown hair, he's thinking about tempo and counterpoint and such?","Of course he is.","Music has to have form, or it's just noise.","But it has to be inspired, or it's just flat.","Flat.","Now you're making sharp remarks.","Funny, but really...not.","The difference between trite popular music and the stuff that lasts is inspiration.","Or perhaps it's skill, talent, and application.","That too, maybe.","But they have to feel it, or they're just pushing notes around.","So you thnk the more intensely a composer or songwriter feels, the better his work.","Or hers.","Yes I do.","While you think she just has to know her business, and then work at it industriously.","Or he.","Picture that composer, alone with his score, writing and rewriting, hearing it all in the silence.","That person can't be high on love.","But have you ever heard a group, late at night in some bar, playing to each other, comunicating like they're psychic?","Yeah, and when I've felt that, I've been tired, and sleepy, and susceptible.","Now you're just being contrary.","You've felt it.","But what I've felt isn't necessarily real.","Music, you know, is mathematical.","It's thought.","Music, even if you don't know, is emotion."]},
{"tag": "Have", "patterns":[ "Have you heard any good bands lately?"], "responses": ["Sure.","What kind of music do you like?","I like indie and also some rap.","Okay well Phoenix has a great new single out.","Oh yeah?","What is it called?","It's called Ti Amo and their music is really fun.","Okay I will check them out.","Cool.","Definitely give their old music a listen too.","So how about some rap suggestions\nWell I really like Kendrik Lamar, Migos and Childish Gambino right now.","I heard that Childish Gambino is doing one last album then retiring from music.","No way!","that bums me out.","Yeah he is really talented.","I like how all of this stuff really changes.","Yeah, every album has a different emotion and feel to it.","I think that his newest stuff is really great.","He is finally enjoying mainstream success.","I keep hearing \"Redbone\" on the radio.","Yeah it was in a movie and has become super popular.","Good for him.","Yeah his music is great."]},
{"tag": "Hamilton", "patterns":[ "What did you think of the Hamilton Mixtape?"], "responses": ["Could anything ever compete with the brilliance of the original sountrack?","Definitely not, but there's some cool new takes on the mixtape.","I did really like the \"Immigrants We Get The Job Done\" song with K'NAAN.","And the Ashanti and Ja Rule version of \"Helpless?\"","Going back to 2001 with that pairing.","The Sia and Queen Latifah combo on \"Satisfied\" is also brilliant.","I guess Sia can't rap!","Queen Latifah hits it out of the park, though!","The whole mixtape is a really eclectic group of artists.","Chance the Rapper and Jimmy Fallon on the same album?","Jimmy Fallon's song is so hilarious!","He makes for a perfect King George.","Have you seen the original Hamilton on Broadway yet?","The tickets are so expensive!","At this point I don't have hundreds of dollars for a Broadway show.","But it'd be so worth it.","My sister saw it earlier this year and said it will be the greatest Broadway show of all time.","And Alexander Hamilton wasn't the most likely Broadway musical star.","But his story really fits Broadway.","I think we're also searching for our origin story as a country.","What were our values?","How were we made?","And the conflicts you see in the music are still happening in today's politics.","Big government, small government?","Like in the rap battle between Hamilton and Thomas Jefferson?","And George Washington moderating?","What colonial revolutionary will be the star of the next Broadway hit musical?","Please, please let it be Dolly Madison!","Heck, I'll write that show!"]},
{"tag": "Okay", "patterns":[ "Okay, best concert ever?"], "responses": ["This one is easy.","Bruce Springsteen, 1978, Darkness on the Edge of Town tour.","I can't disagree.","I hadn't been to too many concerts at that point, but I knew he was something special.","Yes, and I've never seen anything likerhim since.","I haven't seen any of his concerts since that were as good, although all are incredibly good.","Watching him dance up there with so much energy, even after playing for 3 hours was incredible.","Yes, and Clarence Clemmons' solos felt like you could fly away on them.","God rest his soul.","Yeah, that was a big loss for the world.","Max Weinberg made me LOVE the drums starting at that concert.","I loved the stories he told, and the way he weaved them into the song intros.","Oh, for sure.","Rosalita!","And Spirit in the Night!","You know, maybe the greatest accomplishment of Bruce Springsteen (among many accomplishments) is the way he has made so many thousands of people, more like hundreds of thousands, so intensely happy for at least a few hours in their life.","I can't argue with that.","As you said, so many accomplishments, but making people happy is important.","Without happiness it's hard to feel alive, and happiness is so rare for most people in this tough world.","I think it's so impressive that all his albums stand up, after all these years.","True, true.","I still love Greetings from Asbury Park and I still play it.","Oh, me too, me too.","And some of his albums that weren't such huge hits are still fantastic.","Right, Nebraska, Human Touch ","","\nLucky Town, released at the same time as Human Touch, and Tunnel of Love.","I could listen to Bruce all night.","Maybe I'll turn on my all Bruce play list when I get home."]},
{"tag": "So", "patterns":[ "So what kind of music do you like?"], "responses": ["Well I like all sorts, except for country music.","Oh okay, me too.","I feel like I know a lot about current music but not a lot about classics.","Like Rolling Stones, or Led Zeppelin?","Yeah, I mean I know who they are, just not really familiar with their music.","Oh okay, well would you like me to list off a few more?","Yeah for sure!","Well, what's a current band you like and we can think of older bands that sound like that.","Well I like a lot of indie rock music.","I think indie takes a lot of inspiration from classic rock and roll.","Okay, like who for example?","Like, LCD Soundsystem sounds a lot like 80's music.","Really?","Like who?","The Talking Heads, Echo and the Bunneymen, and The Cure.","What would you classify them as?","Well the Talking heads is more experimental.","What's a song I've heard from them maybe?","Psycho Killer.","Oh yeah, I have heard that one."]},
{"tag": "Let", "patterns":[ "Let's get dark about music."], "responses": ["Bring it.","Let's assume you are on your deathbed in a hospice and you can choose your playlist.","Okay.","What do you want to listen to as you die?","Oooh, good one.","That's a heck of an ice","breaker.","Yeah, I always ask this on blind dates.","I'm having the time of my life.","Let me think about it "," what about yours?","I want something super slow and gorgeous.","\"Cantus in Memory of Benjamin Britten?\"","That's a great choice, but no.","I think the Jurassic Park theme.","I thought you said slow and gorgeous.","That's loud and brassy.","Have you heard it slowed by 1000%?","It's about an hour long.","No, what's it like?","Slow and gorgeous, as I said.","You can't really hear where they are in it, but you know what's happening at the same time.","Interesting.","Yours?","The Oceanic six theme from Lost.","It's unbeliveably gorgeous.","I haven't seen that so I don't know it.","It's got constant counterpoint.","I warm up and go limp when I hear it.","I think it'd be nice."]},
{"tag": "Justin", "patterns":[ "Did you know Justin beiber is from Canada?"], "responses": ["Did you know you should never say Justin beiber to me again?","What,  why?","Don't you like his music?","No.","Not really my style.","Now metallica.","That's music.","Are they Canadian?","What?","No!","Dude what's with you and Canada.","Have you really not heard of metallica?","No.","What are some of their songs?","Master of puppets, enter sandman?","Never heard of them.","I listen to more wizard rock than real rock.","Ummm.","What's wizard rock,  date I ask?","Have you seen Harry potter?","Wizard rock is the type of music the band plays at the dance.","It's about dwarfes and stuff.","Wow, ok I didn't know that.","I'll stick with acdc and guns and roses.","Oh acdc is great,  I love axl rose!","You know axl rose but haven't heard of metallica?","Also axl rose is from guns and roses.","I have so much to learn about music.","Ok I'll teach you.","We'll start with do.","Check out holy diver.","Great song!","Ok I'll do that,  but you have to listen to Justin beiber.","Sure,  whatever you say.","I'll get right on that.","Did you know ed sheeran wrote a couple of his songs?","Really?","No,  I didn't.","Mauve"]},
{"tag": "Who", "patterns":[ "Who is the best guitar player ever?"], "responses": ["My vote goes to Keith Richards.","Is he from the Rolling Stones?","Yes!","He is a phenomenal guitar player.","I don't think he is the best though.","Who do you think is the best guitar player ever?","I think Bob Dylan.","Really?","No way!","Bob Dylan is one of the most talented musicians I have ever heard.","But I do not think he is the best guitar player ever.","What about John Mayer?","Is he one of the best?","He is an incredible musician as well, but I do not think he is amongst the best guitar players.","Even though he filled in and played with the Grateful Dead?","Yes.","I just do not think he is as talented as someone like Keith Richards.","I guess we will agree to disagree then.","We should read SPIN magazine or a periodical like that.","I bet they will have a list of the best guitar players.","They might.","But these lists are always so subjective.","At the end of the day, I suppose it doesn't matter.","Right!","There are so many amazing guitar players.","We are luck to have such great music.","Agreed!","Let's go home and put on some albums!"]},
{"tag": "Who", "patterns":[ "Who has been your favorite to see in concert?"], "responses": ["I think for me it is between Michael jackson or the killers.","Wow, Both great artists but I think michael jackson would be much better to see live.","Well I was really young at the time, but still really enjoyed it .","It was the bad tour.","Oh wow , what a show to have seen.","It really was, I still recall all the lights and the roar of the crowd was crazy loud.","How can The killers be in the same arena even?","Well I think because they are now one of my favorite bands.","I was older seeing them and a smaller venue.","Small venues can make all the difference, how small are we talking here?","Well it was a cincinnati casino show.","It is an outside stage but it is small so you end up super close even in the back.","Sounds good, but I would want it to be a closet small to compete with michael.","Alright jackson's concert will go down in history as the best for me, but killers was a close second.","What about you?","Favorite to see in concert would be paul simon, graceland tour.","I love paul simon.","Me too, my parents took me to this concert when I was young.","It was so cool to see the tribe perform with him.","Wait there was a tribe ?","Yes the south africans who were featured on the album actually came on tour.","It was very incredible.","You mean Ladysmith Black Mambazo?","Yes I think that is their name.","I was really young at the time.","but still goes down as the greatest for me.","Funny how impactful those first memories can be in your mind."]},
{"tag": "What", "patterns":[ "What do you prefer, opera music or symphony music?"], "responses": ["Ah, that's hard.","They overlap a lot.","But I think I prefer arias to symphonies.","I prefer arias to symphonies as well but I do like concertos.","I like arias because they are shorter.","I like the vocals.","I like concertos when I am trying to read or study.","But, it depends on the aria.","I don't like modern opera.","Oh, I recently saw Nixon in China.","I thought it was brillant.","I have seen it too and I hated it!","I thought the music didn't have any style.","I don't agree at all.","I love modern opera, especially in English.","Nope.","I don't want anything written after 1920 and nothing in Engish.","What about modern classical music?","Some of it is all right, like Aaron Copeland, but not too modern.","I like the Grand Canyon Suite and the Syncopated clock.","I like those too.","I think they are very approachable.","What do you think of Porgy and Bess?","I like Porgy and Bess, but I have a hard time seeing it as an opera.","I think there is a fine line between opera and musical theater.","I would agree with that, especially when I think about Andrew Lloyd Weber.","Yeah, like Le Mis and Phantom of the Opera.","I agree."]},
{"tag": "What", "patterns":[ "What music have you been listening to lately?"], "responses": ["I've been getting really into The Mountain Goats.","Oh, cool.","I think I've heard of them.","What genre are they?","I'd say they're sort of folk and rock, but mostly rock.","Nice!","I've heard some people say that about Dinosaur Jr, is it like that?","No, not really.","The Mountain Goats has a lot of guitar, and less other stuff, at least in his earlier work.","His?","Wait, I thought this was a band.","Well, it is, but it's mostly this one guy, John Darnielle.","He's the only permanent member.","Oh, did he kick those other people out?","No, he just has different people that join it or leave depending on what they need for an album.","Huh.","If I wanted to check them out, where should I start?","Probably with the album Sunset Tree!","It's a bit older but it's a fan favorite.","Alright, I'll look into it.","Do you have a favorite song?","This Year is really good, and usually the first song people hear by them.","Sounds great!","I love knowing what songs are my friend's favorites.","Speaking of which, what have you been listening to?","I just listened to Master of Reality for the first time.","The Black Sabbath album.","Really?","How was it?","It's so good.","The song Sweet Leaf is absolutely killer.","Yeah, it really is.","I think it's the second","best song they ever made."]},
{"tag": "Kiss", "patterns":[ "Have you ever heard of the musical song perform by Kiss?"], "responses": ["Yes, I have heard their music, but I wasn't sure what group made the music.","What kind of musical Group is Kiss?","This is a group consist of four musicians.","Are they all from the same country?","I am not sure if they are from the same Country or not.","What kind of music do they music?","They are a legendary rock and roll band that is great on the piano, organ and guitar.","Where can I find their music?","You can find their music on youtube or attended their concerts.","Does this band go on tour?","Yes, they do lots tours.","When are their next tour?","I am not sure, but soon.","How do this band dress?","They dress in boots with high heels, black leather jacket and leather pants.","Do you like their music?","Yes, I love their music, especially at the end of song Beth.","Do you have a favorite song that they sing?","Yes, I like the song Beth, the leader of Beth is Eric."]
}

   ]
}
